[
{"No": "73481407", "Title": "Pandas group by row to sum columns, and return with the least two", "Content": "A data frame as below:  I want to find out the least 2 project names from the sum of projects'. Like: David ['Project_C', 'Project_D'] Kate  ['Project_B', 'Project_D'] Mike  ['Project_A', 'Project_B', ...", "Vote": "0", "Answer": "0", "View": "4", "Author": "Mark K"},
{"No": "73481395", "Title": "Pandas df plot x-axis date labels reformatting", "Content": "would appreciate any help as I haven't found any questions covering this. I'm plotting a line graph with date on x axis: df = pd.read_csv('random.csv') df.plot('date', 'y') plt.xlabel('Dates') plt....", "Vote": "0", "Answer": "0", "View": "5", "Author": "pablotoucan"},
{"No": "73481370", "Title": "Going to Specific Location using Neural Network in ROS", "Content": "i am developing a program that can be used to move the turtlebot to specific location using neural network with lidar sensors. in this program i have some problem, can move the turtlebot and avoid the ...", "Vote": "0", "Answer": "0", "View": "8", "Author": "Anto"},
{"No": "73481366", "Title": "Python: sort a list of dictionary using mutliple keys", "Content": "I have a  list of dictionary of the previous 12 months values.   I would like to sort it based on year and then month, without importing any extra libraries. Current Input [{'key': '2021 Mar', 'value':...", "Vote": "0", "Answer": "0", "View": "20", "Author": "123456"},
{"No": "73481305", "Title": "How can I find google flights URL query parameters?", "Content": "I have been trying to scrape google flights: I am using selenium python to automate google flights(https://www.google.com/travel/flights). But selenium is slow and sometimes it's hard to automate a ...", "Vote": "0", "Answer": "0", "View": "17", "Author": "Sorower Hossan"},
{"No": "73481302", "Title": "List object not callable when calculating temperatues", "Content": "Im trying to calculate the minimum temperature, but when I try to print it, It says that the min is equal to the value returned by the function but i get an error like this: TypeError: 'list' object ...", "Vote": "0", "Answer": "0", "View": "19", "Author": "Nano Casas"},
{"No": "73481253", "Title": "Discord.ext checking if user has manage message permissions?", "Content": "For my discord bot I have a clr command and I need to see if the user who used the command has permissions to manage messages. How can I do that? (New To Discord.ext) from discord.ext import commands ...", "Vote": "0", "Answer": "0", "View": "7", "Author": "RRTropical"},
{"No": "73481249", "Title": "Jupyter notebook executions turn grey in Visual studio code", "Content": "I am trying to execute python code in VS code enabling jupyter notebook execution.Repeatedly the execution screen turns gray which makes the output invisible with the headers.Code will be still ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "VIDYA RENUKA"},
{"No": "73481245", "Title": "Incorrect Context Appearing in Django Project", "Content": "I am creating a workout project where for every workout there is a list of exercises and for every exercise there is a list of sets which has specific weights and reps. Here is the model for more ...", "Vote": "0", "Answer": "0", "View": "10", "Author": "A_K"},
{"No": "73481229", "Title": "What is the best practice for a re-pull from git?", "Content": "I'm currently working with django and python from git repo. It is understandable that I should pull and establish a virtual environment (venv) in the cloned directory. I also had installed all the ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "shanksfk"},
{"No": "73481220", "Title": "Removing index from pandas data frame on print", "Content": "I'm really struggling to get this to print the way I want to. I've read through the documentation on removing index, but it seems like it still shows up. Here is my code: quotes = pd.read_csv(\"...", "Vote": "0", "Answer": "2", "View": "19", "Author": "Dragnipur"},
{"No": "73481208", "Title": "Failed to import DolphinDB Python API", "Content": "Environment: Windows, Python 3.8.0 pip install dolphindb has been executed, but it failed to import dolphindb in Python. >>> import dolphindb as ddb  Traceback (most recent call last):    ...", "Vote": "0", "Answer": "0", "View": "4", "Author": "Eva Gao"},
{"No": "73481181", "Title": "How to remove background from an image and set outline using python?", "Content": "What I am going to do  Remove background from an image (removed area should be transparent) Add a white outline to the image  I investigate ways to remove background from images and found several ways ...", "Vote": "0", "Answer": "0", "View": "7", "Author": "Tony Wayne"},
{"No": "73481169", "Title": "What is the deeper reason I cannot call a function with named arguments in C/C++ but I can do so in Python?", "Content": "In Python, I can call a function with named arguments as below. def sum (i1,i2):     return (i1 + i2)  print (sum(i1 = 2,i2 = 3))  However in C/C++ I cannot: #include <iostream>  using namespace ...", "Vote": "-4", "Answer": "5", "View": "59", "Author": "sidewind"},
{"No": "73481166", "Title": "Using eval() to assess user input and some condition. What alternatives?", "Content": "First, to provide some context, I am designing a console based version of Blackjack for entertainment and learning purposes.The code below was my solution to evaluate different conditions given user ...", "Vote": "2", "Answer": "1", "View": "37", "Author": "Paulo Martins"},
{"No": "73481162", "Title": "How to let if fuction output only one output in python?", "Content": "I am trying to use if function to classify the items into 3 categories in python. My code is as follows. WBS4_ELEMENT_list_0 = ['F.1122023.117.2.001', 'F.1122012.024.2.001', 'F.1622016.AET.2.001', 'F....", "Vote": "0", "Answer": "1", "View": "21", "Author": "CanaryTheBird"},
{"No": "73481160", "Title": "convert an array of integers to an array of floats", "Content": "Given any integer n convert it to a float 0.n #input [11 22 5 1 68 17 5 4 558]  #output [0.11  0.22  0.5   0.1   0.68  0.17  0.5   0.4   0.558]  Is there a way in numpy to do the following. import ...", "Vote": "0", "Answer": "3", "View": "31", "Author": "codeLearner"},
{"No": "73481153", "Title": "AttributeError: 'DataFrame' object has no attribute 'explode'", "Content": "My code is throwing this error when I try to run it, and I don't understand why. I'm confused as to why it's throwing an AttributeError when the line clearly calls .explode(...) as a function. Any ...", "Vote": "0", "Answer": "0", "View": "16", "Author": "wheeeee"},
{"No": "73481132", "Title": "How to get data from views to consumers py. Django", "Content": "I wanted to get the data from my views.py def index(request):     if request.method == 'POST':         post_data = json.loads(request.body.decode(\"utf-8\"))         value = post_data.get('...", "Vote": "0", "Answer": "0", "View": "10", "Author": "Cason Mercadejas"},
{"No": "73481122", "Title": "Using google colab forms input as dropdown, can I put the read file and add on the total list?", "Content": "I using google colab to share my code with people who don't know Python at all. To make it easy, I adapt forms into the cell which makes be able to select the options and parameters. parameters = &...", "Vote": "0", "Answer": "0", "View": "7", "Author": "Gangil Seo"},
{"No": "73481121", "Title": "Optimizer Adagrad from Scratch in Python-Error", "Content": "I try to implement Adagrad algorithm with the next code: def back_propagate_Adagrad(error, learning_rate,eps):    self.cache=np.zeros(len(self.dW)+1)     for i in reversed(range(len(self.dW))):       ...", "Vote": "0", "Answer": "0", "View": "6", "Author": "Al.Vioky"},
{"No": "73481104", "Title": "how to correct this code to verify for all the a's in the code to check for the sample code? [closed]", "Content": "The following program calculates the number of input strings with letter ‘a’, and end the program when the input string is “####”. Here is an expected sample run: enter a string (enter #### to stop): ...", "Vote": "-1", "Answer": "1", "View": "24", "Author": "Aishwarya Anand"},
{"No": "73481094", "Title": "How do I create a new module in django and register the classes in that module", "Content": "I want to create a new module and set of middleware classes in my app.  I created a subfolder \"middleware\" and put my python classes there in separate files.  But when I try to access them ...", "Vote": "0", "Answer": "1", "View": "16", "Author": "Mike Oliver"},
{"No": "73481092", "Title": "How to pull values from JSON into pandas dataframe using a string as the index value", "Content": "I am looking to build a dataframe utilizing certain data from a JSON with multiple nested dictionaries. An example of the format of the JSON is as follows: \"leagueYear\": \"2021\",    ...", "Vote": "0", "Answer": "1", "View": "15", "Author": "Tim D"},
{"No": "73481090", "Title": "Drag and drop from QListWidget to QGraphicsItem", "Content": "I'm looking for how i can do the same thing like this : https://www.walletfox.com/course/dragdroplistscene.php with Python with PyQt5 library, but i don't know how i can do it. How i can do a subclass ...", "Vote": "0", "Answer": "0", "View": "9", "Author": "Ronaldonizuka"},
{"No": "73481089", "Title": "Fast API request hangs when passing parameters to another endpoint", "Content": "When I reference another endpoint inside an async function in my Fast API script, that endpoint will hang and fail to load. Despite http://127.0.0.1:8000/data?nums=1&nums=2&nums=3 returning ...", "Vote": "0", "Answer": "0", "View": "13", "Author": "xTrevi"},
{"No": "73481059", "Title": "Memory leak in AWS Lambda when calling local folder", "Content": "I have a python script that I'm currently using just to figure out how to use a docker container image and deploy it to lambda using a few libraries. The code is as follows: from transformers import ...", "Vote": "0", "Answer": "0", "View": "11", "Author": "shkadov"},
{"No": "73481035", "Title": "Can't not use kwargs in tk.CheckButton [duplicate]", "Content": "This is an qusition on tk.Checkbutton, i code a function to setting checkbutton from tkinter import Checkbutton, PhotoImage, Tk, BooleanVar\r def setCheckButton(root):     on_image = PhotoImage(width=...", "Vote": "0", "Answer": "0", "View": "10", "Author": "Kenisnotme"},
{"No": "73481033", "Title": "How to make post request to list of webhooks at the same time python", "Content": "i'm trying to make something that will take a url of a discord webhook and make a post request to it while also continuing in the loop for example:     await kdot.create_webhook(name='K.Dot#0001')     ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "This Shit"},
{"No": "73481028", "Title": "error with aiter in telethon bot in python", "Content": "i'm trying to loop inside my async function for my bot, and for the autodestruction function i have to iterate all the users and check if the user is an admin, done with this code: all_participants = ...", "Vote": "0", "Answer": "0", "View": "8", "Author": "ElToreador"},
{"No": "73481011", "Title": "I want to upload my logs from ec2 to s3 through boto3", "Content": "My log name contains the date, and I want to collect and upload log data with those dates. But I dont know about python its my first time in my life help me and Thank you for your advise", "Vote": "-1", "Answer": "0", "View": "11", "Author": "neeson.lee"},
{"No": "73480989", "Title": "Remove columns which match some pattern in python", "Content": "I have a large csv files which have several columns as follows:\r M_15_19_yr_ M_19_25_yr_ M_25_35_yr_\r 20 34 12\r 09 21 19\r I want to remove such columns which start from M_{age1}_{age2}_yr. I tried ...", "Vote": "2", "Answer": "2", "View": "23", "Author": "surviving-grad"},
{"No": "73480966", "Title": "how can i import a function from another python file when the function is assigned to a variable name (ie from XYZ import f\"{funcname}\" [duplicate]", "Content": "So, i have some code that randomizes function names in another python file, it can find the function name just fine but how would i go about importing the function, ill better lay-out the question ...", "Vote": "0", "Answer": "0", "View": "9", "Author": "Himikotiro"},
{"No": "73480938", "Title": "Calculate sum of multiples rows with a value in another column, and store the new value in a new column", "Content": "I have a time series data where I would like to calculate sum of 4 quarters and divide the result with a value in another column. Here is my data example. In reality I will have 10K+ rows. df = pd....", "Vote": "0", "Answer": "1", "View": "14", "Author": "DNS"},
{"No": "73480911", "Title": "AtributeError: __enter__ in python", "Content": "Performing a CRUD in python, I created the connection class where is two class methods: getConnection and getCursor, when I created the PersonDAO class and its class method called seleccionar and ...", "Vote": "-2", "Answer": "0", "View": "34", "Author": "Luishi"},
{"No": "73480900", "Title": "Organizing a list of dictionaries in Python", "Content": "I have a huge list of dictionaries with data labeled as follows {'id': 2,  'text': '\"The hotel has many restaurants to enjoy a meal. My husband and I went to the Japanese restaurant and we only ...", "Vote": "0", "Answer": "2", "View": "36", "Author": "bavarianbear"},
{"No": "73480884", "Title": "Need a solution so when I press Enter, turtle draws a different shape", "Content": "The code I am trying to write needs to make 5 different shapes, which only one is included.   I am not worried about coding the other 4. What I need to know is how do I set it up so every time I press ...", "Vote": "0", "Answer": "0", "View": "23", "Author": "Jose Diaz"},
{"No": "73480869", "Title": "ValueError: time data does not match format '%Y-%m-%d %H:%M:%S'", "Content": "I use twint for scraping data from twitter. Code as follows import twint import nest_asyncio nest_asyncio.apply()\r  # Configure c = twint.Config() c.Limit = 500 c.Since = '2022-01-01' c.Until = '2022–...", "Vote": "0", "Answer": "0", "View": "17", "Author": "Raffi El"},
{"No": "73480849", "Title": "Best practices for scheduling multiple jobs at different frequencies in a Python project?", "Content": "I have started scheduling a couple scripts in Python using launchd. All my imports are from the root directory, though, so unless I want to mess with sys.path (which feels like poor practice) I need ...", "Vote": "0", "Answer": "0", "View": "20", "Author": "Oliver R"},
{"No": "73480847", "Title": "Datetime.strptime format for 2022-08-24T04:57:17.065000+00:00", "Content": "We have the following string in a variable: date_variable = \"2022-08-24T04:57:17.065000+00:00\"  We would like to convert this to datetime. The following does not work: timestamp_formatted = ...", "Vote": "0", "Answer": "1", "View": "15", "Author": "Jack tileman"},
{"No": "73480835", "Title": "Sum percentages by condition", "Content": "everyone. I don't know how to solve this. I would like to sum the percentages according to the result. Let me explain; all the % values for example with result i -1 should be summed (leaving the sign ...", "Vote": "0", "Answer": "1", "View": "38", "Author": "Prectux"},
{"No": "73480827", "Title": "Difference in Methods for Merging Transformed PDF Pages in PyPDF2", "Content": "I'm attempting to create a function to add a bottom \"margin\" to pages in existing PDFs.  Those bottom margins then need to be populated with specific text determined by the file and page.  I ...", "Vote": "0", "Answer": "0", "View": "3", "Author": "dewser_the_board"},
{"No": "73480826", "Title": "Generating a list of sequences without repeating elements from a panda dataframe using Python", "Content": "I am trying to create a a list of sequences based on the following three columns panda table. The data table would look like: |FROM|OPERATION|TO| |   2|       10| 1| |   2|       11| 4| |   1|       ...", "Vote": "-1", "Answer": "0", "View": "30", "Author": "Jun Kataoka"},
{"No": "73480774", "Title": "Can I create a Middleware class in one app that handles requests in other apps on the site", "Content": "In reading the, Middlware Documentation I can see I can write a middleware class that will see and has access to every request in my app, which is good. What if I want my Middleware to see and handle ...", "Vote": "0", "Answer": "0", "View": "25", "Author": "Mike Oliver"},
{"No": "73480771", "Title": "Tox installs the wrong dependencies", "Content": "py310-django32-oauthlib1 create: /mydirectory py310-django32-oauthlib1 create: /mydirectory/.tox/py310-django32-oauthlib1 py310-django32-oauthlib1 installdeps: oauthlib==1.1.2, django~=3.2.10, ....etc ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "wonton"},
{"No": "73480741", "Title": "Python dictionary where values are lists, how to remove Xth item from every list value", "Content": "I have dictionary in the form of: dict_one =  { key2: [val1, val2, val3], key2: [val1, val2, val3] }  I want to remove 'val3' from every element in the dictionary. I believe this should be possible ...", "Vote": "0", "Answer": "3", "View": "34", "Author": "Adam Gold"},
{"No": "73480737", "Title": "is it possible that an 8 puzzle is unsolvable", "Content": "I am trying to create a Python program that solves the famous 8-puzzle. How do I check if the 8-puzzle is solvable? I tried the inversion method for this puzzle.  which resulted in the following 5 -&...", "Vote": "-1", "Answer": "0", "View": "27", "Author": "omar mostafa"},
{"No": "73480734", "Title": "How to send a list of emails using python and how to add image to my email", "Content": "I have a list of email but I dont know how to send it. I used this code but its not working. Also, I would like to know how to add an image. reading the spreadsheet email_list = pd.read_excel('path') ...", "Vote": "0", "Answer": "0", "View": "11", "Author": "Matheus Neves"},
{"No": "73480729", "Title": "How do you get a cross section of data from a Pandas dataframe with a key for a MultiIndex?", "Content": "I have a dataframe like this A, B, C d, 1, 2 d, 3, 4 e, 5, 6 e, 7, 8  I am trying to get B, C 1, 2 3, 4  and B, C 5, 6 7, 8  By iterating through d, e, etc. I can get the keys just fine looping though ...", "Vote": "0", "Answer": "2", "View": "20", "Author": "John Glen"},
{"No": "73480719", "Title": "Leetcode difference between submission and console answer checking", "Content": "I have some code for Leetcode question 2266. (Python) https://leetcode.com/problems/count-number-of-texts/ class Solution:     def countTexts(self, pressedKeys: str) -> int:         # steps:        ...", "Vote": "0", "Answer": "0", "View": "14", "Author": "pew"}
]