[
{"No": "73481407", "Title": "Pandas group by row to sum columns, and return with the least two", "Content": "A data frame as below:  I want to find out the least 2 project names from the sum of projects'. Like: David ['Project_C', 'Project_D'] Kate  ['Project_B', 'Project_D'] Mike  ['Project_A', 'Project_B', ...", "Vote": "0", "Answer": "0", "View": "4", "Author": "Mark K"},
{"No": "73481395", "Title": "Pandas df plot x-axis date labels reformatting", "Content": "would appreciate any help as I haven't found any questions covering this. I'm plotting a line graph with date on x axis: df = pd.read_csv('random.csv') df.plot('date', 'y') plt.xlabel('Dates') plt....", "Vote": "0", "Answer": "0", "View": "5", "Author": "pablotoucan"},
{"No": "73481370", "Title": "Going to Specific Location using Neural Network in ROS", "Content": "i am developing a program that can be used to move the turtlebot to specific location using neural network with lidar sensors. in this program i have some problem, can move the turtlebot and avoid the ...", "Vote": "0", "Answer": "0", "View": "8", "Author": "Anto"},
{"No": "73481366", "Title": "Python: sort a list of dictionary using mutliple keys", "Content": "I have a  list of dictionary of the previous 12 months values.   I would like to sort it based on year and then month, without importing any extra libraries. Current Input [{'key': '2021 Mar', 'value':...", "Vote": "0", "Answer": "0", "View": "20", "Author": "123456"},
{"No": "73481305", "Title": "How can I find google flights URL query parameters?", "Content": "I have been trying to scrape google flights: I am using selenium python to automate google flights(https://www.google.com/travel/flights). But selenium is slow and sometimes it's hard to automate a ...", "Vote": "0", "Answer": "0", "View": "17", "Author": "Sorower Hossan"},
{"No": "73481302", "Title": "List object not callable when calculating temperatues", "Content": "Im trying to calculate the minimum temperature, but when I try to print it, It says that the min is equal to the value returned by the function but i get an error like this: TypeError: 'list' object ...", "Vote": "0", "Answer": "0", "View": "19", "Author": "Nano Casas"},
{"No": "73481253", "Title": "Discord.ext checking if user has manage message permissions?", "Content": "For my discord bot I have a clr command and I need to see if the user who used the command has permissions to manage messages. How can I do that? (New To Discord.ext) from discord.ext import commands ...", "Vote": "0", "Answer": "0", "View": "7", "Author": "RRTropical"},
{"No": "73481249", "Title": "Jupyter notebook executions turn grey in Visual studio code", "Content": "I am trying to execute python code in VS code enabling jupyter notebook execution.Repeatedly the execution screen turns gray which makes the output invisible with the headers.Code will be still ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "VIDYA RENUKA"},
{"No": "73481245", "Title": "Incorrect Context Appearing in Django Project", "Content": "I am creating a workout project where for every workout there is a list of exercises and for every exercise there is a list of sets which has specific weights and reps. Here is the model for more ...", "Vote": "0", "Answer": "0", "View": "10", "Author": "A_K"},
{"No": "73481229", "Title": "What is the best practice for a re-pull from git?", "Content": "I'm currently working with django and python from git repo. It is understandable that I should pull and establish a virtual environment (venv) in the cloned directory. I also had installed all the ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "shanksfk"},
{"No": "73481220", "Title": "Removing index from pandas data frame on print", "Content": "I'm really struggling to get this to print the way I want to. I've read through the documentation on removing index, but it seems like it still shows up. Here is my code: quotes = pd.read_csv(\"...", "Vote": "0", "Answer": "2", "View": "19", "Author": "Dragnipur"},
{"No": "73481208", "Title": "Failed to import DolphinDB Python API", "Content": "Environment: Windows, Python 3.8.0 pip install dolphindb has been executed, but it failed to import dolphindb in Python. >>> import dolphindb as ddb  Traceback (most recent call last):    ...", "Vote": "0", "Answer": "0", "View": "4", "Author": "Eva Gao"},
{"No": "73481181", "Title": "How to remove background from an image and set outline using python?", "Content": "What I am going to do  Remove background from an image (removed area should be transparent) Add a white outline to the image  I investigate ways to remove background from images and found several ways ...", "Vote": "0", "Answer": "0", "View": "7", "Author": "Tony Wayne"},
{"No": "73481169", "Title": "What is the deeper reason I cannot call a function with named arguments in C/C++ but I can do so in Python?", "Content": "In Python, I can call a function with named arguments as below. def sum (i1,i2):     return (i1 + i2)  print (sum(i1 = 2,i2 = 3))  However in C/C++ I cannot: #include <iostream>  using namespace ...", "Vote": "-4", "Answer": "5", "View": "59", "Author": "sidewind"},
{"No": "73481166", "Title": "Using eval() to assess user input and some condition. What alternatives?", "Content": "First, to provide some context, I am designing a console based version of Blackjack for entertainment and learning purposes.The code below was my solution to evaluate different conditions given user ...", "Vote": "2", "Answer": "1", "View": "37", "Author": "Paulo Martins"},
{"No": "73481162", "Title": "How to let if fuction output only one output in python?", "Content": "I am trying to use if function to classify the items into 3 categories in python. My code is as follows. WBS4_ELEMENT_list_0 = ['F.1122023.117.2.001', 'F.1122012.024.2.001', 'F.1622016.AET.2.001', 'F....", "Vote": "0", "Answer": "1", "View": "21", "Author": "CanaryTheBird"},
{"No": "73481160", "Title": "convert an array of integers to an array of floats", "Content": "Given any integer n convert it to a float 0.n #input [11 22 5 1 68 17 5 4 558]  #output [0.11  0.22  0.5   0.1   0.68  0.17  0.5   0.4   0.558]  Is there a way in numpy to do the following. import ...", "Vote": "0", "Answer": "3", "View": "31", "Author": "codeLearner"},
{"No": "73481153", "Title": "AttributeError: 'DataFrame' object has no attribute 'explode'", "Content": "My code is throwing this error when I try to run it, and I don't understand why. I'm confused as to why it's throwing an AttributeError when the line clearly calls .explode(...) as a function. Any ...", "Vote": "0", "Answer": "0", "View": "16", "Author": "wheeeee"},
{"No": "73481132", "Title": "How to get data from views to consumers py. Django", "Content": "I wanted to get the data from my views.py def index(request):     if request.method == 'POST':         post_data = json.loads(request.body.decode(\"utf-8\"))         value = post_data.get('...", "Vote": "0", "Answer": "0", "View": "10", "Author": "Cason Mercadejas"},
{"No": "73481122", "Title": "Using google colab forms input as dropdown, can I put the read file and add on the total list?", "Content": "I using google colab to share my code with people who don't know Python at all. To make it easy, I adapt forms into the cell which makes be able to select the options and parameters. parameters = &...", "Vote": "0", "Answer": "0", "View": "7", "Author": "Gangil Seo"},
{"No": "73481121", "Title": "Optimizer Adagrad from Scratch in Python-Error", "Content": "I try to implement Adagrad algorithm with the next code: def back_propagate_Adagrad(error, learning_rate,eps):    self.cache=np.zeros(len(self.dW)+1)     for i in reversed(range(len(self.dW))):       ...", "Vote": "0", "Answer": "0", "View": "6", "Author": "Al.Vioky"},
{"No": "73481104", "Title": "how to correct this code to verify for all the a's in the code to check for the sample code? [closed]", "Content": "The following program calculates the number of input strings with letter ‘a’, and end the program when the input string is “####”. Here is an expected sample run: enter a string (enter #### to stop): ...", "Vote": "-1", "Answer": "1", "View": "24", "Author": "Aishwarya Anand"},
{"No": "73481094", "Title": "How do I create a new module in django and register the classes in that module", "Content": "I want to create a new module and set of middleware classes in my app.  I created a subfolder \"middleware\" and put my python classes there in separate files.  But when I try to access them ...", "Vote": "0", "Answer": "1", "View": "16", "Author": "Mike Oliver"},
{"No": "73481092", "Title": "How to pull values from JSON into pandas dataframe using a string as the index value", "Content": "I am looking to build a dataframe utilizing certain data from a JSON with multiple nested dictionaries. An example of the format of the JSON is as follows: \"leagueYear\": \"2021\",    ...", "Vote": "0", "Answer": "1", "View": "15", "Author": "Tim D"},
{"No": "73481090", "Title": "Drag and drop from QListWidget to QGraphicsItem", "Content": "I'm looking for how i can do the same thing like this : https://www.walletfox.com/course/dragdroplistscene.php with Python with PyQt5 library, but i don't know how i can do it. How i can do a subclass ...", "Vote": "0", "Answer": "0", "View": "9", "Author": "Ronaldonizuka"},
{"No": "73481089", "Title": "Fast API request hangs when passing parameters to another endpoint", "Content": "When I reference another endpoint inside an async function in my Fast API script, that endpoint will hang and fail to load. Despite http://127.0.0.1:8000/data?nums=1&nums=2&nums=3 returning ...", "Vote": "0", "Answer": "0", "View": "13", "Author": "xTrevi"},
{"No": "73481059", "Title": "Memory leak in AWS Lambda when calling local folder", "Content": "I have a python script that I'm currently using just to figure out how to use a docker container image and deploy it to lambda using a few libraries. The code is as follows: from transformers import ...", "Vote": "0", "Answer": "0", "View": "11", "Author": "shkadov"},
{"No": "73481035", "Title": "Can't not use kwargs in tk.CheckButton [duplicate]", "Content": "This is an qusition on tk.Checkbutton, i code a function to setting checkbutton from tkinter import Checkbutton, PhotoImage, Tk, BooleanVar\r def setCheckButton(root):     on_image = PhotoImage(width=...", "Vote": "0", "Answer": "0", "View": "10", "Author": "Kenisnotme"},
{"No": "73481033", "Title": "How to make post request to list of webhooks at the same time python", "Content": "i'm trying to make something that will take a url of a discord webhook and make a post request to it while also continuing in the loop for example:     await kdot.create_webhook(name='K.Dot#0001')     ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "This Shit"},
{"No": "73481028", "Title": "error with aiter in telethon bot in python", "Content": "i'm trying to loop inside my async function for my bot, and for the autodestruction function i have to iterate all the users and check if the user is an admin, done with this code: all_participants = ...", "Vote": "0", "Answer": "0", "View": "8", "Author": "ElToreador"},
{"No": "73481011", "Title": "I want to upload my logs from ec2 to s3 through boto3", "Content": "My log name contains the date, and I want to collect and upload log data with those dates. But I dont know about python its my first time in my life help me and Thank you for your advise", "Vote": "-1", "Answer": "0", "View": "11", "Author": "neeson.lee"},
{"No": "73480989", "Title": "Remove columns which match some pattern in python", "Content": "I have a large csv files which have several columns as follows:\r M_15_19_yr_ M_19_25_yr_ M_25_35_yr_\r 20 34 12\r 09 21 19\r I want to remove such columns which start from M_{age1}_{age2}_yr. I tried ...", "Vote": "2", "Answer": "2", "View": "23", "Author": "surviving-grad"},
{"No": "73480966", "Title": "how can i import a function from another python file when the function is assigned to a variable name (ie from XYZ import f\"{funcname}\" [duplicate]", "Content": "So, i have some code that randomizes function names in another python file, it can find the function name just fine but how would i go about importing the function, ill better lay-out the question ...", "Vote": "0", "Answer": "0", "View": "9", "Author": "Himikotiro"},
{"No": "73480938", "Title": "Calculate sum of multiples rows with a value in another column, and store the new value in a new column", "Content": "I have a time series data where I would like to calculate sum of 4 quarters and divide the result with a value in another column. Here is my data example. In reality I will have 10K+ rows. df = pd....", "Vote": "0", "Answer": "1", "View": "14", "Author": "DNS"},
{"No": "73480911", "Title": "AtributeError: __enter__ in python", "Content": "Performing a CRUD in python, I created the connection class where is two class methods: getConnection and getCursor, when I created the PersonDAO class and its class method called seleccionar and ...", "Vote": "-2", "Answer": "0", "View": "34", "Author": "Luishi"},
{"No": "73480900", "Title": "Organizing a list of dictionaries in Python", "Content": "I have a huge list of dictionaries with data labeled as follows {'id': 2,  'text': '\"The hotel has many restaurants to enjoy a meal. My husband and I went to the Japanese restaurant and we only ...", "Vote": "0", "Answer": "2", "View": "36", "Author": "bavarianbear"},
{"No": "73480884", "Title": "Need a solution so when I press Enter, turtle draws a different shape", "Content": "The code I am trying to write needs to make 5 different shapes, which only one is included.   I am not worried about coding the other 4. What I need to know is how do I set it up so every time I press ...", "Vote": "0", "Answer": "0", "View": "23", "Author": "Jose Diaz"},
{"No": "73480869", "Title": "ValueError: time data does not match format '%Y-%m-%d %H:%M:%S'", "Content": "I use twint for scraping data from twitter. Code as follows import twint import nest_asyncio nest_asyncio.apply()\r  # Configure c = twint.Config() c.Limit = 500 c.Since = '2022-01-01' c.Until = '2022–...", "Vote": "0", "Answer": "0", "View": "17", "Author": "Raffi El"},
{"No": "73480849", "Title": "Best practices for scheduling multiple jobs at different frequencies in a Python project?", "Content": "I have started scheduling a couple scripts in Python using launchd. All my imports are from the root directory, though, so unless I want to mess with sys.path (which feels like poor practice) I need ...", "Vote": "0", "Answer": "0", "View": "20", "Author": "Oliver R"},
{"No": "73480847", "Title": "Datetime.strptime format for 2022-08-24T04:57:17.065000+00:00", "Content": "We have the following string in a variable: date_variable = \"2022-08-24T04:57:17.065000+00:00\"  We would like to convert this to datetime. The following does not work: timestamp_formatted = ...", "Vote": "0", "Answer": "1", "View": "15", "Author": "Jack tileman"},
{"No": "73480835", "Title": "Sum percentages by condition", "Content": "everyone. I don't know how to solve this. I would like to sum the percentages according to the result. Let me explain; all the % values for example with result i -1 should be summed (leaving the sign ...", "Vote": "0", "Answer": "1", "View": "38", "Author": "Prectux"},
{"No": "73480827", "Title": "Difference in Methods for Merging Transformed PDF Pages in PyPDF2", "Content": "I'm attempting to create a function to add a bottom \"margin\" to pages in existing PDFs.  Those bottom margins then need to be populated with specific text determined by the file and page.  I ...", "Vote": "0", "Answer": "0", "View": "3", "Author": "dewser_the_board"},
{"No": "73480826", "Title": "Generating a list of sequences without repeating elements from a panda dataframe using Python", "Content": "I am trying to create a a list of sequences based on the following three columns panda table. The data table would look like: |FROM|OPERATION|TO| |   2|       10| 1| |   2|       11| 4| |   1|       ...", "Vote": "-1", "Answer": "0", "View": "30", "Author": "Jun Kataoka"},
{"No": "73480774", "Title": "Can I create a Middleware class in one app that handles requests in other apps on the site", "Content": "In reading the, Middlware Documentation I can see I can write a middleware class that will see and has access to every request in my app, which is good. What if I want my Middleware to see and handle ...", "Vote": "0", "Answer": "0", "View": "25", "Author": "Mike Oliver"},
{"No": "73480771", "Title": "Tox installs the wrong dependencies", "Content": "py310-django32-oauthlib1 create: /mydirectory py310-django32-oauthlib1 create: /mydirectory/.tox/py310-django32-oauthlib1 py310-django32-oauthlib1 installdeps: oauthlib==1.1.2, django~=3.2.10, ....etc ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "wonton"},
{"No": "73480741", "Title": "Python dictionary where values are lists, how to remove Xth item from every list value", "Content": "I have dictionary in the form of: dict_one =  { key2: [val1, val2, val3], key2: [val1, val2, val3] }  I want to remove 'val3' from every element in the dictionary. I believe this should be possible ...", "Vote": "0", "Answer": "3", "View": "34", "Author": "Adam Gold"},
{"No": "73480737", "Title": "is it possible that an 8 puzzle is unsolvable", "Content": "I am trying to create a Python program that solves the famous 8-puzzle. How do I check if the 8-puzzle is solvable? I tried the inversion method for this puzzle.  which resulted in the following 5 -&...", "Vote": "-1", "Answer": "0", "View": "27", "Author": "omar mostafa"},
{"No": "73480734", "Title": "How to send a list of emails using python and how to add image to my email", "Content": "I have a list of email but I dont know how to send it. I used this code but its not working. Also, I would like to know how to add an image. reading the spreadsheet email_list = pd.read_excel('path') ...", "Vote": "0", "Answer": "0", "View": "11", "Author": "Matheus Neves"},
{"No": "73480729", "Title": "How do you get a cross section of data from a Pandas dataframe with a key for a MultiIndex?", "Content": "I have a dataframe like this A, B, C d, 1, 2 d, 3, 4 e, 5, 6 e, 7, 8  I am trying to get B, C 1, 2 3, 4  and B, C 5, 6 7, 8  By iterating through d, e, etc. I can get the keys just fine looping though ...", "Vote": "0", "Answer": "2", "View": "20", "Author": "John Glen"},
{"No": "73480719", "Title": "Leetcode difference between submission and console answer checking", "Content": "I have some code for Leetcode question 2266. (Python) https://leetcode.com/problems/count-number-of-texts/ class Solution:     def countTexts(self, pressedKeys: str) -> int:         # steps:        ...", "Vote": "0", "Answer": "0", "View": "14", "Author": "pew"}
][
{"No": "73523222", "Title": "Finding a value in a tuple that is not in a list of tuples", "Content": "I have a tuple and a list of tuples. The tuple is titled talent and is a tuple from a JSON parse, it contains data about a specific student and the books that student has checked out (book-id-list) ...", "Vote": "0", "Answer": "0", "View": "34", "Author": "TechJunkie"},
{"No": "73523206", "Title": "Python version of Moment.js fromNow()", "Content": "I am a big fan of the Moment.js function which returns a human-readable version of how long ago something happens: console.log( moment([2018, 0, 29]).fromNow() ) # outputs: 4 years ago  I've been ...", "Vote": "-1", "Answer": "1", "View": "17", "Author": "Ucinorn"},
{"No": "73523193", "Title": "How to get the columns with null values in GridDB?", "Content": "I have GridDB Python client running on my Ubuntu computer. I would like to get the columns having null values using a GridDM query. I know it’s possible to get the rows with null values but I want ...", "Vote": "0", "Answer": "0", "View": "7", "Author": "Jessica Chris"},
{"No": "73523186", "Title": "How to copy a certain thing from a message discord.py", "Content": "I would like to copy a certain word from a message [user]. The [user] would be a value entered by someone. This would be an example of a message: Username: [User]  Stocked Items: [Infos]  Location: [...", "Vote": "-1", "Answer": "0", "View": "23", "Author": "Theo"},
{"No": "73523151", "Title": "Python cv2 webcam only display solid cyan color", "Content": "I've been stuck here for hours and have no idea why it only displays solid cyan color, I've tried both my PC and my laptop, and the outcome are just the same.  Here's my code: import cv2   webcam = ...", "Vote": "0", "Answer": "1", "View": "17", "Author": "Zigatronz"},
{"No": "73523144", "Title": "Cross-validation for random forest regression", "Content": "Let us image a dataset that is split into training and test sets. In order to estimate the hyperparameters of a model I would perform GridSearchCV using only the train data and performing cross-...", "Vote": "0", "Answer": "1", "View": "20", "Author": "jado"},
{"No": "73523143", "Title": "Append to empty list with multiprocessing pool [duplicate]", "Content": "From a broader level, this is what I am trying to do - append to an empty list an item it reads from the elements list with multiprocessing pool, but this is printing an empty list. Any idea where I ...", "Vote": "0", "Answer": "0", "View": "25", "Author": "user106742"},
{"No": "73523116", "Title": "how to get product dimensions from amazon page python web scraping", "Content": "i was wondering how i can get the product dimensions and weight from an amazon page. this is the page: https://www.amazon.com/Vic-Firth-American-5B-Drumsticks/dp/B0002F73Z8/ref=...", "Vote": "-1", "Answer": "3", "View": "30", "Author": "Noah Hellyer"},
{"No": "73523110", "Title": "i have a \\a error and don't know how to fix my /a problem in my code [duplicate]", "Content": "so my issue right now is I'm trying to have \"C:\\Users\\asattler175\" in my script (trying to get file names in directories) and it always errors because of \\a. any ideas/solutions?", "Vote": "-2", "Answer": "0", "View": "21", "Author": "Ron_Hub"},
{"No": "73523104", "Title": "How to find test error and training error in Weka", "Content": "Is training error the number of incorrect classified instances in (training test set) and test error is the number of incorrect classified instances in cross validation ? I am confused if test error ...", "Vote": "0", "Answer": "0", "View": "19", "Author": "Ali Sena Nazari"},
{"No": "73523086", "Title": "using a VAE for density estimation", "Content": "I reask this question, because i have overhauled my code a lot, and I feel this exceeds editing my prior question. I am currently trying to use a Variational Autoencoder for density estimation. ...", "Vote": "0", "Answer": "0", "View": "14", "Author": "Till Schwake"},
{"No": "73523067", "Title": "Using Dplyr group_by and summarize with pandas", "Content": "I am trying to create a separate pandas DataFrame in python using pandas'.groupby function. I am working with basketball data and want to create a column that displays if the home and away teams are ...", "Vote": "-1", "Answer": "0", "View": "14", "Author": "Brad"},
{"No": "73523049", "Title": "Python: How do I get an if statement to check if a condition is true at the end of a for loop?", "Content": "Specifically, I'm doing the hangman challenge from the 100 days of coding by UDEMY.  I can't seem to figure out how to check if the user has lost by reaching \"0\" of \"6\" lives.  ...", "Vote": "-1", "Answer": "1", "View": "35", "Author": "supersolid123"},
{"No": "73523042", "Title": "Best way to index dictionary", "Content": "my_roster_dict = {'p': 'clayton kershaw',                   'rf': 'mookie betts',                   '1b': 'cody bellinger'}  How would it be possible only print items with the last name of b? I've ...", "Vote": "-2", "Answer": "2", "View": "33", "Author": "Roy Krishnan"},
{"No": "73523038", "Title": "Selenium Webdriver Recognized as Malware on Windows (Python)", "Content": "I wrote a program in Python that needs to perform tasks on the browser with Selenium. I build a one-file exe and tried to run it on my Windows machine, yet Windows seems to recognize it as some ...", "Vote": "0", "Answer": "2", "View": "17", "Author": "dezan"},
{"No": "73523023", "Title": "How to fix number of returned rows in Pandas?", "Content": "I build a code that extracting data from YouTube by search query, and now I need to convert my output data into the pandas data frame, so later I will be able to export this as .csv. But now I stuck ...", "Vote": "0", "Answer": "1", "View": "41", "Author": "Volodymyr Arc"},
{"No": "73523021", "Title": "Trying to get auto login to work in Selenium Python - it can find the relevant iframe but not the field", "Content": "I am trying to make a script to keep me logged into the Disneyworld website - sometimes when I am trying to make a reservation, it takes me to a login screen at inopportune times, so I am trying to ...", "Vote": "0", "Answer": "0", "View": "8", "Author": "user525966"},
{"No": "73523019", "Title": "Why am i getting invalid syntax when adding a def?", "Content": "import pygame import math  #initialise pygame pygame.init()  #game window WINDOW_WIDTH = 1200 WINDOW_HEIGHT = 750  #create game window win = pygame.display.set_mode((WINDOW_WIDTH, WINDOW_HEIGHT)) ...", "Vote": "0", "Answer": "1", "View": "30", "Author": "hello"},
{"No": "73523015", "Title": "How to make VS Code Jupiter Notebook to stop code execution before a given cell?", "Content": "How to make VS Code Jupiter Notebook to stop code execution before a given cell? I know that it is possible to start code execution from a certain cell and down by clicking the 'Execute Cell and Below'...", "Vote": "0", "Answer": "1", "View": "19", "Author": "newnewer"},
{"No": "73522995", "Title": "Function that takes folder name as argument (python)", "Content": "I am trying to write a function that deleting all directories and files except the one (folder_to_exclude) def cleanDir(self,dirpath, folder_to_exclude, handler):          for root, dirs, files in ...", "Vote": "-1", "Answer": "1", "View": "30", "Author": "Dorga"},
{"No": "73522985", "Title": "Why wont this code work properly its doing more than 20 question and it is only doing the easy level not medium or hard", "Content": "from random import randint  name = input(\"What's your name? \")  print(f'Welcome to this maths quiz {name} you will get ten question with addition,  subtraction, multiplication and division, ...", "Vote": "0", "Answer": "3", "View": "39", "Author": "user19841319"},
{"No": "73522976", "Title": "Adding a margin to pygame window", "Content": "I have a lot of hardcoded coordinates for my game, I would like to add something similiar to a margin to the window, so that the game is still in the centre but there is some padding around the top, ...", "Vote": "0", "Answer": "0", "View": "17", "Author": "jr123456jr987654321"},
{"No": "73522954", "Title": "how to get two or more classes in ursina to detect collusion?", "Content": "So im new to ursina and listen to a lot of youtube how to's and alot of github, doc for ursina, reddit, etc. before i got into it. well i decided to get into the actual coding part and pick this code ...", "Vote": "0", "Answer": "0", "View": "7", "Author": "loudmounth artist"},
{"No": "73522951", "Title": "Invalid Integer Error with Basic Python Coding [closed]", "Content": "enter image description hereenter image description hereHello, I am completing a very basic code for my beginning Python Programming course. I have attached a picture of the code. When I input the “...", "Vote": "-3", "Answer": "2", "View": "33", "Author": "Mariah C"},
{"No": "73522877", "Title": "Python updating stock option field into three fields", "Content": "I've been struggling with this problem for sometime.  I'm a hobby developer and self taught, but no where near intermediate.  My for loop appears to work properly, until I try to add to the data frame ...", "Vote": "0", "Answer": "2", "View": "52", "Author": "user1470034"},
{"No": "73522857", "Title": "Making a bot handle logs", "Content": "I would like my bot to be able to handle logs. A log message would be like this: Username: [User] Stocked items: [Value] Location: [Value] Proof: [Image]  My goal is to make that when someone reacts ...", "Vote": "-1", "Answer": "1", "View": "18", "Author": "Theo"},
{"No": "73522844", "Title": "Leetcode \"Word Search II\" algorithm finding all but one word [closed]", "Content": "I am working on the Word Search II algorithm in Leetcode. Problem description:  Given an m x n board of characters and a list of strings words, return all words on the board. Each word must be ...", "Vote": "-2", "Answer": "0", "View": "35", "Author": "Anarchaic"},
{"No": "73522837", "Title": "GUI and extract from excel", "Content": "Please help me with this code. Basically what I am trying to do is create a userform to fill in a template (with name of assessor, date, role of assessor etc), then extract the rest of the data for ...", "Vote": "0", "Answer": "1", "View": "21", "Author": "AM96"},
{"No": "73522825", "Title": "entry/exit decorator for async function", "Content": "How may I write an equivalent decorator/wrapper for async functions, which will log when the async completes (returns or raises), without simply making it synchronous by awaiting it. import functools  ...", "Vote": "2", "Answer": "1", "View": "26", "Author": "some bits flipped"},
{"No": "73522809", "Title": "Julia Sets Generator", "Content": "I tried to modify mandlebrot set generator code in order to create the Julia sets of a specified complex number but it doesn't seem to work for any complex number. Why is this? from numpy import array ...", "Vote": "-1", "Answer": "0", "View": "15", "Author": "yannc"},
{"No": "73522789", "Title": "flask restx api - marshal table oriented json?", "Content": "I'm looking to set an api to return a dataframe formatted as a table oriented json but I can't seem to get it to map out correctly, the returned json is always just full of nulls. Using the following ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "user1267983"},
{"No": "73522785", "Title": "Why won't my uWSGI Dash app load properly?", "Content": "I am trying to create my first Dash app and using this tutorial from DigitalOcean for a walkthrough on how to setup uWSGI and Nginx which has resulted in the following code: from dash import Dash, ...", "Vote": "-1", "Answer": "0", "View": "20", "Author": "DougM"},
{"No": "73522745", "Title": "Trying to scrape image url's in Python using beautiful soup", "Content": "I'm new to Python and need some help. I am trying to scrape the image urls from this site but can't seems to do so. I pull up all the html. Here is my code. import requests import pandas as pd import ...", "Vote": "0", "Answer": "2", "View": "18", "Author": "sammybouzy"},
{"No": "73522709", "Title": "Python Pandas Dataframe values ​not under the columns", "Content": "Why do I get the values ​​not under the columns? data = {\"audioRuntime_converted\": [InsertBook.audioRuntime_converted], \"category_converted\": [InsertBook.category_converted]}\r     ...", "Vote": "0", "Answer": "0", "View": "41", "Author": "raffaele de france"},
{"No": "73522708", "Title": "Undefined reference to cpp function while using Swig and setuptools", "Content": "I'm trying to use C++ from Python with SWIG, starting with a simple example. All my files are in the same directory. example.cpp double add_from_c(double x, double y) {     return x + y; }  example.h ...", "Vote": "0", "Answer": "1", "View": "35", "Author": "Oliver Mohr Bonometti"},
{"No": "73522704", "Title": "How can I use trained deepspeech AIs when they are provided trained on a Google Drive?", "Content": "I want to use the deepspeech model provided here https://github.com/AASHISHAG/deepspeech-german#results. They give trained models to Download and I want to use on of them ( https://drive.google.com/...", "Vote": "1", "Answer": "0", "View": "12", "Author": "Dennis"},
{"No": "73522676", "Title": "Is there a way utilizing pandas in python to input display the column name and also the datatype. Also how would is be possible to display info under", "Content": "where employee ID is the column name and then int64 is the datatype. employee_id: int64 Range: 1.34 - 2.07 Mean: 1.71 Standard deviation: 0.11 Median: 1.71 (this is just an example as I am new to ...", "Vote": "1", "Answer": "1", "View": "13", "Author": "808mans"},
{"No": "73522675", "Title": "Expand currency sign with moving words inside string", "Content": "How can I achieve this without using if operator and huge multiline constructions? Example: around $98 million last week above $10 million next month about €5 billion past year after £1 billion this ...", "Vote": "2", "Answer": "4", "View": "50", "Author": "bashism"},
{"No": "73522666", "Title": "Imutils WebcamVideoStream raising segmentation fault", "Content": "I am trying to process frames from a camera via rtsp in my docker container. However, a segmentation fault error is popping up. I have already checked the camera address and it is working properly. My ...", "Vote": "0", "Answer": "0", "View": "9", "Author": "Mathews Edwirds"},
{"No": "73522662", "Title": "Python BeautifulSoup finding table and parsing it", "Content": "This one is an odd one I ran this code in the morning and it worked just fine on the html from page. Now when I run it the tables variable comes back 0 items so the for loop never happens and no data ...", "Vote": "0", "Answer": "0", "View": "22", "Author": "Leo Torres"},
{"No": "73522657", "Title": "how to compress single file to tar.gz", "Content": "Am trying to compress a single file the required output ==> myfile.tar.gz==>myfile.tar==>myfile.bin the command I run ... subprocess.call(['tar', '-zcvf', '/path/to/desitnation/myfile.tar.gz',...", "Vote": "0", "Answer": "1", "View": "15", "Author": "Exorcismus"},
{"No": "73522651", "Title": "Trouble with injecting Callable", "Content": "I'm using python-dependency-injector. I tried this code and it worked perfectly: https://python-dependency-injector.ets-labs.org/providers/callable.html that page also mentioned next:  Callable ...", "Vote": "0", "Answer": "0", "View": "5", "Author": "cool_cat"},
{"No": "73522648", "Title": "Trying to ouput an randomly generate password into an Eletron App using Python Shell", "Content": "I'm making my first project with Electron. It's a password manager and generator. My main objective right now is to display a randomly generated password into the app using Python Shell, but can't ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "Victor Svart"},
{"No": "73522643", "Title": "confusion with types in python [closed]", "Content": "I am trying to play with an rfid reader that I got for my raspberry pi. I have written a small test file which mostly works except that when reading the code from the card (1236) python does not find ...", "Vote": "-2", "Answer": "0", "View": "24", "Author": "andyswings"},
{"No": "73522625", "Title": "Serialize JSON from Python dataclass that has Decimal [duplicate]", "Content": "I have a class in Python called TransactionData: from dataclasses import dataclass from decimal import *\r @dataclass(unsafe_hash=True) class TransactionData:     date: str     transaction: str     ...", "Vote": "0", "Answer": "0", "View": "10", "Author": "clattenburg cake"},
{"No": "73522624", "Title": "Uncaught (in promise) Error: invalid inputs detected; op: Conv_3", "Content": "I am currently trying to run a CNN with onnx that takes in a Tensor of shape [1, 210]. The torch.onnx.export works successfully with a dummy_input of shape [1, 210]. Although the model loads without ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "Mikhail Dmitrienko"},
{"No": "73522622", "Title": "Function returns same value for each person", "Content": "I'm working on a project for school to learn Python. In this project you are sitting at a restaurant and you program the bill. When I calculate the total of what everyone spend in a function and ...", "Vote": "0", "Answer": "1", "View": "39", "Author": "tim Justins"},
{"No": "73522614", "Title": "requests.headers in flask is returning unwanted values", "Content": "I have this simple function in my flask app: @ app.route(f\"/getrqstdetails\") def getDetails():     headers = dict(request.headers)     cookies = dict(request.cookies)     rqst_details = f'{...", "Vote": "-1", "Answer": "0", "View": "12", "Author": "user2401856"},
{"No": "73522607", "Title": "Derivative of Panda Series in Python using Scipy.misc", "Content": "I have data in CSV file, I am extracting data using iloc into variables. So I have 2 series one is the data and the other is time. I want to derivate the data with respect to time and then plot the ...", "Vote": "0", "Answer": "1", "View": "8", "Author": "Najeeb Qureshi"},
{"No": "73522603", "Title": "specifying dependencies needed for .py file run through BashOperator() with apache airflow", "Content": "I'm trying to automate the process of running a webscraper daily with apache airflow and docker. I have the airflow server up and running and I can manually initialize my dag through the airflow GUI ...", "Vote": "0", "Answer": "0", "View": "22", "Author": "Kyle"},
{"No": "73522552", "Title": "More pythonic way of referencing an object's attributes before it is completely initialized", "Content": "I've encountered a problem where, during the initialization of my main class, I create an instance of another class and attach it to an attribute: # DOES NOT WORK (game instance not initialised yet) ...", "Vote": "0", "Answer": "0", "View": "38", "Author": "AuraZz"},
{"No": "73522547", "Title": "Why i already have installed modules in my virtualenv?", "Content": "I have globally installed modules in my pc, but when i create a virtualenv some of the modules are already preinstalled in it, but when i execute 'pip freeze' in my virtualenv there are no installed ...", "Vote": "0", "Answer": "1", "View": "30", "Author": "Subham Kumar Paul"},
{"No": "73522546", "Title": "Safe way to update Database using JSON response from API", "Content": "I'm studying on transferring data from a database, made available through a JSON response from an API. In the tests I've done so far, they've been successful, but I have a doubt for the continuation ...", "Vote": "0", "Answer": "0", "View": "33", "Author": "collected"},
{"No": "73522542", "Title": "DiscordPy Extension 'cogs.economy' raised an error: TypeError: object NoneType can't be used in 'await' expression", "Content": "I get the following error when i run my bot. discord.ext.commands.errors.ExtensionFailed: Extension 'cogs.economy' raised an error: TypeError: object NoneType can't be used in 'await' expression  I ...", "Vote": "1", "Answer": "1", "View": "27", "Author": "zassar"},
{"No": "73522528", "Title": "No module named joblib Python", "Content": "I'm trying to run this : https://github.com/HansiMcKlaus/AudioSpectrumVisualizer And so I followed needed to be done to run it. I pip install all the requirements, ffmpeg and try to run with the ...", "Vote": "0", "Answer": "2", "View": "13", "Author": "Pierre Marsaa"},
{"No": "73522525", "Title": "Trying to print leader board [closed]", "Content": "I am trying to print a leader board of the top 5 scores in my card game. The scores and the players name are written to  file. I need to extract the data from this file and only print the top 5 ...", "Vote": "0", "Answer": "0", "View": "28", "Author": "Laboratory gaming"},
{"No": "73522524", "Title": "Validate Google Extended Access Article signature (Python)", "Content": "Google Extended Access Google Extended Access provides access to news article beyond the Publisher paywall if the user signs in via Google OAuth. The number of access is based on metering. More info. ...", "Vote": "0", "Answer": "0", "View": "22", "Author": "AjanShrestha"},
{"No": "73522506", "Title": "Count elements of a page after it's rendered and print the amount in Python", "Content": "Say there's a website with multiple elements that get rendered using ng-repeat / ngFor, and some of these elements have a specific label X, I want to be able to scrape the html, count the amount of Xs ...", "Vote": "0", "Answer": "0", "View": "14", "Author": "giozzz"},
{"No": "73522500", "Title": "Headless mode in Api \"Dolphin Anty\" selenium", "Content": "I'm using antidetect browser Api \"Dolphin anty\" with python selenium and I want to enable Headless mode, but in this Api commands options.headless = True and options.addarguments( --headless ...", "Vote": "0", "Answer": "0", "View": "9", "Author": "Ambamamba"},
{"No": "73522498", "Title": "I can't align my data of the same dimensions to create a model", "Content": "I have a dataset of the weather conditions of tennis matches. It keeps the information of the matches played or not played according to the weather conditions. Using some of this data, I predict ...", "Vote": "1", "Answer": "0", "View": "24", "Author": "UtariD"},
{"No": "73522494", "Title": "Why do I get traceback erros when using python on CMD?", "Content": "I dont really know what's happening here. I installed python 3.10.6 but I can seem to any python commands in windows cmd. I was trying to install opencv for a project. But can seem to use pip or any ...", "Vote": "0", "Answer": "2", "View": "14", "Author": "Gaell Gelacio"},
{"No": "73522465", "Title": "Numpy - most efficient way to find 2d array in another 2darray", "Content": "I'm new with numpy, trying to understand how to search for 2d array in another 2d array. I don't need indexes, just True/False For example I've an array with shape 10x10, all ones and somewhere it has ...", "Vote": "0", "Answer": "2", "View": "52", "Author": "Digital God"},
{"No": "73522450", "Title": "How to use a Python class as content of slicing brackets in Numpy", "Content": "In Python you can use a tuple as the content of the brackets matrix = np.zeros((3, 4, 8, 9)) coords = (2, 3) element = matrix[coords]  I would like to do the same with a custom class CustomDuple duple ...", "Vote": "-1", "Answer": "1", "View": "21", "Author": "Mert Mint"},
{"No": "73522449", "Title": "Python Best starter Course? I just learn automate tasks in windows [closed]", "Content": "I want to learn to automate my own things. How can i set up my computer to automatically open 2 chrome pages, when i start my computer? thats it it's about staying focused.  Which course or tutorial ...", "Vote": "-3", "Answer": "0", "View": "14", "Author": "Jill Garlinghouse"},
{"No": "73522447", "Title": "Django DM model constraint: uniqueConstraint or checkConstraint?", "Content": "I am trying to define a unique constraint for my DB model. I have 3 constraints and have no trouble with 2. But the 3rd one is doing my head a little. So the model class is fairly simply; its a social ...", "Vote": "1", "Answer": "1", "View": "15", "Author": "Sadiq"},
{"No": "73522432", "Title": "Remove single quote and escaping characters from a string", "Content": "I have an SQL query: \"INSERT INTO table ('id', 'name', 'age_of_use') VALUES (1, 'someone', 33)\"  or 'INSERT INTO table (\"id\", \"name\", 'age_of_use') VALUES (1, 'someone', ...", "Vote": "0", "Answer": "0", "View": "29", "Author": "gbox"},
{"No": "73522423", "Title": "How to show cells with 2 categories in bar chart", "Content": "I have a categorical column with values CatA, CatB, CatC, CatD. But some cells are a combination of those (ex: BC, AC and AB) like image below enter image description here When I want to show them on ...", "Vote": "-3", "Answer": "1", "View": "25", "Author": "Behmand Tirgar"},
{"No": "73521534", "Title": "If / else conditionals not working with input (Beginner python) [duplicate]", "Content": "The output for this code always produces the result for the first if conditional and not for the elsif or else. Been trying to over an hour now and confused. answer = input(\"Hi. Are you human?&...", "Vote": "0", "Answer": "2", "View": "36", "Author": "Exquisite Mong"},
{"No": "73522418", "Title": "Microsoft graph API how to query mails sent to specific address", "Content": "I want to query my outlook messages for specific adresses that I have sent my mails using the documentation here I was able to construct the query below. However, it returns a 400 error code and I do ...", "Vote": "0", "Answer": "1", "View": "12", "Author": "Jeroen Vermunt"},
{"No": "73522408", "Title": "tkinter event binding not handled correctly", "Content": "I have a function in a tkinter application that does some operations on the content of the clipboard, pastes the result to a Text widget, and then should return to the previous application. For the ...", "Vote": "0", "Answer": "0", "View": "25", "Author": "Rodney Boyd"},
{"No": "73522387", "Title": "Converting Midi messages to milliseconds and synchronization in godot", "Content": "I am trying to write a script that takes a midi file and stores each note played along with the timing in milliseconds from that note. I use this json file later on to execute events in a game I am ...", "Vote": "0", "Answer": "0", "View": "11", "Author": "import_theUser"},
{"No": "73522385", "Title": "TemplateDoesNotExist at / chat_app/dashboard.html", "Content": "I am makeing a chat app, and I have run into some issues. I think I hace had this problom befor but I can not figure out how to fix it. Django is sitting the error is where I have the bootstrap import ...", "Vote": "0", "Answer": "0", "View": "13", "Author": "Ethan Koch"},
{"No": "73522381", "Title": "Searching through the last dimension of a 3d header array to pull out last dimension of 5d array", "Content": "Sorry for asking a newbie question. I have a 3d array (t,z,n). The n array is where I want to search for. Once I get the correct array from the 3d header array I want to pass this information to a 5d ...", "Vote": "0", "Answer": "0", "View": "9", "Author": "Kev"},
{"No": "73521530", "Title": "Mixing 2 functions as 1", "Content": "Im having a trouble here, I need to create a function for an empty list with 4 digits random numbers, which I did import random  def numerosazar(n):     random_numeros=[]     for i in range(n):        ...", "Vote": "0", "Answer": "0", "View": "22", "Author": "Gabriel Morales"},
{"No": "73521506", "Title": "How to deploy small python services [closed]", "Content": "i wrote some nice python services that we need in a small company. For example a gRPC-Server as an api for a database. Or an HTTP-Server which serves a REST-Api. What are elegant ways to deploy such ...", "Vote": "1", "Answer": "0", "View": "24", "Author": "LukyLazzer"},
{"No": "73521499", "Title": "Check if elements list are in column DataFrame", "Content": "Objective: I have a list of 200 elements(urls) and I would like to check if each one is in a specific column of the Dataframe. If it is, I would like to remove the element from the list. Problem: I am ...", "Vote": "0", "Answer": "3", "View": "26", "Author": "Carlos Lozano"},
{"No": "73521495", "Title": "How to stop VS Code from removing Python unused imports on save", "Content": "Looking for general advice, as I'm not completely sure what is causing this behavior which I did not encounter until recently. I'm finding it quite annoying because it can delete imports if I comment ...", "Vote": "0", "Answer": "1", "View": "24", "Author": "James Shapiro"},
{"No": "73521466", "Title": "How define multiple Python classes and Inheritance in a single file? [closed]", "Content": "import pandas as pd import numpy as np\r class DataSets(object):     def __init__(self):         self.main_dividend = None         self.get_main_dividend()      def get_main_dividend(self) -> [pd....", "Vote": "-3", "Answer": "0", "View": "28", "Author": "Rashid"},
{"No": "73521463", "Title": "Adding second criteria to np.where in Python", "Content": "I currently have a dataframe that looks roughly like this:\r Column A Column B Column C Column D Comment\r A 200  10 Up\r B 200 X 20 Up\r C 200  100\r D 200 X 60 Up\r E 200 Y 30 Up\r F 200  10 Up\r The ...", "Vote": "0", "Answer": "1", "View": "28", "Author": "user19828448"},
{"No": "73521449", "Title": "How do I adjust the dates of a column in pandas according to a threshhold?", "Content": "I have a data frame with a datetime column like so:   dates 0 2017-09-19 1 2017-08-28 2 2017-07-13  I want to know if there is a way to adjust the dates with this condition:  If the day of the date is ...", "Vote": "0", "Answer": "2", "View": "25", "Author": "The Dodo"},
{"No": "73522380", "Title": "Previous and next letter Python 3.8 [closed]", "Content": "There is a letter given, and i need to find previous and next letter of that letter. [1]: https://www.eolymp.com/en/problems/8610  Input:B Output:A C", "Vote": "-6", "Answer": "1", "View": "22", "Author": "İlaha Algayeva"},
{"No": "73522359", "Title": "Why cant I go around the Recaptcha the second time?", "Content": "I am currently writing a program to log in to investors.com. I am using selenium to write my program. Initially, whenever I click on the \"Sign In\" button. The website would take me to a page ...", "Vote": "1", "Answer": "0", "View": "21", "Author": "Needyboy"},
{"No": "73522324", "Title": "Changing outputs with Twitter API", "Content": "I am trying to make a program that prints how many times a specific keyword has been tweeted about per hour with the Twitter API. I have already fixed the code where it will output the data. from ...", "Vote": "0", "Answer": "1", "View": "12", "Author": "ClaytonTK"},
{"No": "73522322", "Title": "Not able to run a python code in my visual studio code", "Content": "When I try to run any .py file on my vscode ; it always show this error! zsh: command not found: python % which python python not found  % which python3 /Library/Frameworks/Python.framework/Versions/3....", "Vote": "0", "Answer": "2", "View": "31", "Author": "Anshuman Sinha"},
{"No": "73522311", "Title": "Python scraping hebrew - how to convert string \"%d7%a1%d7%99%d7%92%d7%a8\" to normal", "Content": "So I'm scraping a website to get its' data. It's a woocomerce website and a product has multiple variations with different prices. scraping with BeautifulSoup I'm able to get the whole product and ...", "Vote": "1", "Answer": "1", "View": "20", "Author": "Alex i"},
{"No": "73521441", "Title": "Why does this return a list of characters instead of a string in Python when iterating a dictionary using items() [duplicate]", "Content": "Python question: Why does this return a list of characters instead of a list of the keys as strings? d = {'key1': 'aaa', 'key2': 'aaa', 'key3': 'bbb'} a=[]  for k,v in d.items():     a += k  print(a)  ...", "Vote": "0", "Answer": "2", "View": "23", "Author": "JoYKim"},
{"No": "73521423", "Title": "relation \"django_plotly_dash_statelessapp\" does not exist LINE 1: SELECT COUNT(*) AS \"__count\" FROM \"django_plotly_dash_statel", "Content": "I am trying to deploy my Django app on render. But there is an error which I don't understand what type of error is this.Please help to solve this error: ProgrammingError at /nickelpure/[relation &...", "Vote": "0", "Answer": "1", "View": "18", "Author": "Robert_T119"},
{"No": "73521413", "Title": "while trying the pong game in python i used super class to create paddles and when i am tryin to input position for the paddles it is showing error [closed]", "Content": "enter image description here enter image description here class Paddle  (Turtle):     def __int__(self, position):         super().__init__()         self.shape(\"square\")         self....", "Vote": "-3", "Answer": "0", "View": "21", "Author": "Tanuj_0910"},
{"No": "73521406", "Title": "I have used autokeras.image classifier to predict the best model and when i get the best model and i save it and later try to use it i get this error", "Content": "x_unused, x_valid, y_unused, y_valid = train_test_split(x_test_auto, y_test_auto, test_size=0.3, random_state=42)\r clf = autokeras.ImageClassifier(max_trials=30, metrics=['acc'])  clf.fit(x_train, ...", "Vote": "-1", "Answer": "0", "View": "19", "Author": "prayas soni"},
{"No": "73521362", "Title": "Cplex/Pulp/Gurobi decision route for time and space?", "Content": "I have a supply problem optimization, something like this photo:  Something like this photo because my problem is more complex than that, I have time periods where fabrication prices and other cost ...", "Vote": "0", "Answer": "0", "View": "13", "Author": "Warpxz"},
{"No": "73522306", "Title": "Update existing Counter with item frequencies from another list", "Content": "I learned that if there is a single list, collections.Counter can generate the frequency table of all elements in the list. Now I have a function whose return value is a list. This function needs to ...", "Vote": "0", "Answer": "3", "View": "27", "Author": "JACKY88"},
{"No": "73522273", "Title": "error \"Only definite integrals are supported\" with lambdify sympy command", "Content": "I wanna integrate (in sympy) function u over a truncated normal distribution with parameters: mu and sigma whose support is (0,gamma) . I produced pdf function primarily and then tried to integrate. ...", "Vote": "0", "Answer": "0", "View": "15", "Author": "muhamad"},
{"No": "73522269", "Title": "Unable to find pytorch==1.11.0 from inside continuumio/miniconda3 Docker container", "Content": "I'm trying to get pytorch==1.11.0 using the continuumio/miniconda3:4.12.0 Docker image. I first run docker run -i -t continuumio/miniconda3 /bin/bash. Then, in the container, I run: conda search -c ...", "Vote": "1", "Answer": "0", "View": "12", "Author": "nusantara"},
{"No": "73522249", "Title": "Detect a pattern and extract numeric values to then evaluate them and in certain cases replace their modifications in their original position", "Content": "import re  input_text = \"entre las 15 : hs -- 16:10 \"  #Example 1 input_text = \"entre las 21 :  -- 22\"  #Example 2 input_text = \"entre la 1 30 -- 2 \"  #Example 3 ...", "Vote": "1", "Answer": "1", "View": "38", "Author": "Matias Nicolas Rodriguez"},
{"No": "73522238", "Title": "Python backend with GPU - how to develop a cross-platform / webserver solution?", "Content": "I have a Python codebase that utilizes GPU that I would like to distribute in two different ways: 1). As a web application with GPUs provided by the server. 2). As a personal computer standalone that ...", "Vote": "0", "Answer": "0", "View": "8", "Author": "owy"},
{"No": "73521346", "Title": "Is there a way to draw a line between two color image using python? [closed]", "Content": "Is it possible to draw line between two colors in the images using python language? See the example pictures below:", "Vote": "-1", "Answer": "0", "View": "23", "Author": "skysky2000"},
{"No": "73521320", "Title": "I'm trying to add walls when a player gets to a certain score however the wall doesn't draw correctly", "Content": "I am trying to add one of my walls when the player hits a score of 10. The desired behaviour would be for the wall to stay after the score requirement is complete. I have tried a few different ways, ...", "Vote": "-1", "Answer": "0", "View": "23", "Author": "Daniel Neonzz Young"},
{"No": "73521311", "Title": "selenium.common.exceptions.WebDriverException: Message: unknown error: session deleted because of page crash from unknown error:", "Content": "I'm getting recently this new output. I tried everything so far and I can't solve it on my own.  Traceback (most recent call last): File \"main.py\", line 54, in  driver.get(url) File \"/...", "Vote": "0", "Answer": "0", "View": "10", "Author": "Ovtchinnikov"},
{"No": "73521293", "Title": "for loop for password add letters in django", "Content": "so i want to check if my password less from key_bytes (which is 16) then the password will be add \"0\" until it's have len 16. i was using django. for example password = katakataka. it's only ...", "Vote": "-1", "Answer": "4", "View": "34", "Author": "HelpMePlease"},
{"No": "73522226", "Title": "In Python3, is it possible to merge two objects into a new object so that references to the original objects now refer to the new object?", "Content": "Suppose I have a dictionary d = {1: A, 2: A, 3: B, 4: B} and then I have an operation that merges object A and object B into a new object say C = merge(A, B). Is it possible to make all the keys that ...", "Vote": "0", "Answer": "2", "View": "44", "Author": "rt500"},
{"No": "73522221", "Title": "PyQt5 Example of Using `QSizePolicy` to Shrink a Widget", "Content": "I am trying to stop a widget from expanding by setting its size policy but things are not working.  The following code runs: from PyQt5.QtWidgets import* import pyqtgraph as pg  class MainWindow(...", "Vote": "0", "Answer": "0", "View": "9", "Author": "温泽海"},
{"No": "73522220", "Title": "How to draw a line in VR in HARFANG?", "Content": "I am using HARFANG for a scientific visualization project in VR, with the Python API. I based my work on the tutorial given here: https://github.com/harfang3d/tutorials-hg2/blob/master/scene_vr.lua ...", "Vote": "0", "Answer": "0", "View": "6", "Author": "pyblek"},
{"No": "73522212", "Title": "Find text of an </a> tag within a </td> tag [closed]", "Content": "Python, beautiful soup 4 td_object_soup.find(‘a’) returns None. When I print the td_object_soup it only shows part of it. The full html is linked in an image post below. https://www.reddit.com/user/...", "Vote": "-1", "Answer": "0", "View": "14", "Author": "Luk"},
{"No": "73522201", "Title": "websockets.exceptions.ConnectionClosedOK:", "Content": "so I want to establish connection with the server initially then send the data from some other function depending upon the choice of user how do i get this done?? import websockets import asyncio  ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "Sarthak Nagoshe"},
{"No": "73522194", "Title": "check if values of a column are in values of another (numpy array)", "Content": "I have a numpy array and I want to create a new one appending the row only if for each row, the element in the columnX is absent in every row of the columnY. I thought about a for loop to do it, but ...", "Vote": "0", "Answer": "2", "View": "23", "Author": "Ludovica"},
{"No": "73522191", "Title": "Iterate through a string and reverse any word with 5 or more characters - Codewars Kata", "Content": "def spin_words(sentence):         words = sentence.split(' ')         newwords = []         reverse = []         for word in words:                 if len(word) < 5:                         ...", "Vote": "1", "Answer": "1", "View": "33", "Author": "DYIII"},
{"No": "73521281", "Title": "How to scrape all p-tag and its corresponding h2-tag with selenium?", "Content": "I want to get title and content of article: example web :https://facts.net/best-survival-movies/ I want to append all p in h2[tcontent-title]  and the result expected is: title=[title1, title2, title3]...", "Vote": "-1", "Answer": "1", "View": "15", "Author": "Thịnh Phạm"},
{"No": "73521255", "Title": "Python : Run commands on terminal - interactive mode", "Content": "I always run commands from python using \"os\". os.system(mycommand) like this : import os def send():     cmdsend = \"echo 'abc' | sudo -S python3 xxx-cli demos -c /root/.config/xxx/...", "Vote": "0", "Answer": "0", "View": "23", "Author": "Salma Madini"},
{"No": "73521253", "Title": "My system cant't figure out the PATH to a virtual env. How do i correct this?", "Content": "I can't get my Pycharm to work. Can someone help me with this ? dyld: Library not loaded: /System/Library/Frameworks/CoreFoundation.framework/Versions/A/CoreFoundation Referenced from: /Library/...", "Vote": "0", "Answer": "0", "View": "23", "Author": "D.Mick"},
{"No": "73521234", "Title": "Convert for loops to list comprenshion", "Content": "is there a way to convert the below statements to one list comprenshion def find_gender(gender_data):     gender = {         \"Women\": [\"women\", \"women's\", \"female&...", "Vote": "-1", "Answer": "2", "View": "56", "Author": "Malik Zohaib Mustafa"},
{"No": "73521213", "Title": "Error while converting adjacency matrix to infer regulatory network", "Content": "I am new to igraph. I have a dataframe, where the importance column contains the weight contains the importance score for each TF gene target pair. This dataframe is generated using GRNBoost2 (https://...", "Vote": "-1", "Answer": "0", "View": "12", "Author": "biomel"},
{"No": "73522185", "Title": "Error: un supported operand type(s) for +: for Integer and String", "Content": "I try several time for solve my problem but Unfortunately I could not fix it. I wanna enter Integer and String for code in terminal but i cant do it . my code: lesson=input('enter your lessons score..\\...", "Vote": "-4", "Answer": "0", "View": "14", "Author": "no body"},
{"No": "73522184", "Title": "Django updating username results in unusable password. How to prevent this?", "Content": "I am using code to update  the user details  and whilst the values are updating I have noticed that when I update the username, which is an email address, the password is set to an unusable password, ...", "Vote": "0", "Answer": "0", "View": "22", "Author": "fmakawa"},
{"No": "73522158", "Title": "How to not Standardize categorical data in pipeline?", "Content": "With this layout, Pipeline Scaler standardizes ALL features, including categorical ones. To correctly apply the Scaler to data with categories, one more ColumnTransformer handler is needed. Help me ...", "Vote": "-1", "Answer": "0", "View": "27", "Author": "Naytriz"},
{"No": "73522148", "Title": "How to update contents of one list with contents from another", "Content": "I have 2 lists. One containing a current stock portfolio ex. (['XYZ', '1029'], ['ABC', '132'], ...) and another containing recently made trades ex. ['Buy', 'XYZ', '109'], ['Sell, 'ABC', '90'], ... I ...", "Vote": "0", "Answer": "3", "View": "30", "Author": "Zack Glew"},
{"No": "73522143", "Title": "Trying to start a loop with bot command using telethon", "Content": "Currently i am trying to create a telethon bot that every 24 hours lists all the partecipants in an targeted telegram group. (code) from telethon import TelegramClient, events from telethon.tl.custom ...", "Vote": "0", "Answer": "0", "View": "30", "Author": "SHIOOu"},
{"No": "73522142", "Title": "mailbox.fetch: Why am i getting this error?", "Content": "Trying to search/delete for specific user with one letter name, \"a\", and always changing domains. Some addresses from this spam: a@kragar.imentss.com a@octobertres.com a@cngruel.com  Need ...", "Vote": "0", "Answer": "0", "View": "19", "Author": "Linh_Lee"},
{"No": "73522125", "Title": "Replit Discord bot blocked from Discord token not found", "Content": "I have been getting this error every time after running the bot, it works for a few hours then I get this, Does anyone have an idea about it? However, every time I change the repl it works and repeats ...", "Vote": "0", "Answer": "0", "View": "10", "Author": "Ahmad Al Nasser"},
{"No": "73523909", "Title": "Cannot open jupyter notebook", "Content": "Jupyter notebooks will not open for me. I've installed a fresh version of Anaconda and I'm still encountering the same issue. This is using Chrome on a Windows 11 machine but I've also had the same ...", "Vote": "0", "Answer": "0", "View": "3", "Author": "Shalom"},
{"No": "73521182", "Title": "Python web scrapping to download multiple data files where links refresh on a weekly basis", "Content": "On a weekly basis I have to access a website (using unique login credentials - username and password) and download four separate xlsx files.  In an attempt to automate this process, I put the ...", "Vote": "-2", "Answer": "0", "View": "31", "Author": "Gdata0data0"},
{"No": "73521179", "Title": "Selenium set new Proxy", "Content": "driver = webdriver.Chrome(ChromeDriverManager().install()) driver.get('https://app.onesignal.com/login')  I create new driver and login this site. After 10-15 login I must change my proxy because I ...", "Vote": "0", "Answer": "0", "View": "6", "Author": "Ali Koçak"},
{"No": "73521169", "Title": "Move across image using Moviepy", "Content": "Using moviepy, I'm trying to make a video where it moves across an image. Why isn't this working?: image = ImageClip('image.png', duration=5) image.set_position(lambda t: ('center', 50+t) ) image.fps =...", "Vote": "0", "Answer": "1", "View": "20", "Author": "THEMOUNTAINSANDTHESKIES"},
{"No": "73521166", "Title": "Getting a value from a specific row and column number in a csv file with Python", "Content": "In the script below, I try to get the values stored in the first column and the second column of the second row of a csv file. For instance for the csv data below: Appel, 21,high,yes  Pear, 23, high, ...", "Vote": "0", "Answer": "2", "View": "21", "Author": "dam's"},
{"No": "73521151", "Title": "How to pass command prompt command as parameter within the python file [closed]", "Content": "I'm trying to make a command [for windows is] to automate some stuff so my questions are 1.How to make a command which runs on any driver. 2.How can I pass the command as an parameter within the ...", "Vote": "-4", "Answer": "0", "View": "14", "Author": "S I D"},
{"No": "73521144", "Title": "How to draw tangential circles to the inside of a curve in Python using numpy and matplotlib in Python?", "Content": "I would like to plot circles which are tangents to the interior of a curve in Python as shown below:  I tried the following approach. I created an inverted exponential curve to get the curve as shown ...", "Vote": "2", "Answer": "3", "View": "33", "Author": "hbstha123"},
{"No": "73521136", "Title": "cant't create scrapy project with python", "Content": "I installed scrapy package by using pip install scrapy   I check if it's installed : import scrapy print(scrapy.__version__) # outputs: 2.6.2  so the scrapy package is well installed but when I want ...", "Vote": "0", "Answer": "0", "View": "23", "Author": "belhichb"},
{"No": "73521131", "Title": "Time picker in pyqt5", "Content": "I am building an application using PyQt5 where it requires date picker and time picker. for date picker I have used QCalendarWidget whereas I'm not able to find anything for time picker. if there is ...", "Vote": "0", "Answer": "1", "View": "17", "Author": "Sadique Khan"},
{"No": "73522121", "Title": "hey there!, i am replicating someone's code as a beginner project and i ran into this error that i can't seem to solve [closed]", "Content": "# unlabel_datala files Bunlabelledtest_files = fnmatch.filter(os.listdir(unlabel_data), 'Bunlabelledtest*.wav') Bunlabelledtest_sounds =load_file_data(folder=unlabel_data,file_names=...", "Vote": "-1", "Answer": "0", "View": "30", "Author": "Sally Concepcion"},
{"No": "73522102", "Title": "How to create and move 2 or more objects simultaneously", "Content": "I was trying to create a function that will load an image and move the image downwards while loading another image and still moving with the same speed as the first.  But I don't know how to do it, ...", "Vote": "0", "Answer": "0", "View": "23", "Author": "De vic"},
{"No": "73522096", "Title": "Why is the proxy not working when sending requests?", "Content": "Comrades, good afternoon. This problem has not been solved for me for some time. I tried many options, with my friends we tested the problem and wrote about it to the developers of the library. But no ...", "Vote": "-1", "Answer": "1", "View": "25", "Author": "rack"},
{"No": "73522086", "Title": "so simple, yet so hard [closed]", "Content": "Write a function id_formater(fn, ln, appelation, city, year) that returns a string of the form \"appelation. ln, fn (city, year)\"  Here's what I did: def id_formater(fn, ln, appelation, city, ...", "Vote": "-4", "Answer": "1", "View": "35", "Author": "Mr. Green"},
{"No": "73523907", "Title": "Subroutine vs functions in python", "Content": "I was reading about a coroutine here. Official docs say  Coroutines are a more generalized form of subroutines. Subroutines are entered at one point and exited at another point. Coroutines can be ...", "Vote": "0", "Answer": "0", "View": "3", "Author": "rawwar"},
{"No": "73523897", "Title": "tensorflow.python.framework.errors_impl.InvalidArgumentError: Retval[0] does not have value", "Content": "File \"D:\\NEW-DMR-master\\model.py\", line 170, in train self.target_ph: targets, Retval[0] does not have value  这个报错是因为targets没有值吗 代码： 1. def train(self, sess, features, targets,lengthlists):  ...", "Vote": "0", "Answer": "0", "View": "7", "Author": "user19867412"},
{"No": "73523869", "Title": "I'm making the snake game in Python3 and keep getting this Error: name 'Tk' is not defined what should I do? [duplicate]", "Content": "I'm trying to make a snake game on Python 3 and keep getting this error when trying to use the TK module for the snake game. In my coding I'm only on the first stage of the coding of the game so I ...", "Vote": "0", "Answer": "0", "View": "7", "Author": "YUSRA GHANI"},
{"No": "73523852", "Title": "python function to return length and product of string returns 'indentation error' and does not run", "Content": "I have tried to create a function to return length of input string and also product of input using for loop and if statements I keeps returning indentation error and doesn't run def dd_function(...", "Vote": "-2", "Answer": "1", "View": "19", "Author": "Brie"},
{"No": "73523851", "Title": "Is there rest api to run python on another comp?", "Content": "I have an old delphi applicaton 22 years old It has the own language inside ( not pascal ) For example hello world: local a  a := 'hello, stackoverflow'  message( a )  It is our own language. The ...", "Vote": "0", "Answer": "0", "View": "11", "Author": "alex"},
{"No": "73523843", "Title": "Can't work out why encryption doesn't work on all shifts?", "Content": "I'm rather new to coding but trying my best. I know there are easier ways to do this but this is what I have come up with. My code asks for the user to either encrypt or decrypt then based off that ...", "Vote": "-1", "Answer": "0", "View": "12", "Author": "Luke Parisi"},
{"No": "73523841", "Title": "My scrapy Spider isn't crawling pages, 'Crawled 0 pages, scraped 0 items. Can't seem to find what's wrong", "Content": "When running 'scrapy crawl newegg' in my console i'm hit with 'Crawled 0 pages (at 0 pages/min), scraped 0 items (at 0 items/min). I have tried looking up many fixes none of which have worked. Any ...", "Vote": "0", "Answer": "0", "View": "13", "Author": "Casey"},
{"No": "73521113", "Title": "Getting mean absolute error loss using KFold for neural network model (TensorFlow)", "Content": "I built a bone age estimation model using TensorFlow, Python. It takes left hand X-ray image as an input and outputs a predicted age in months (I have 10000 images to do the training) and mean ...", "Vote": "0", "Answer": "0", "View": "23", "Author": "Bathtub"},
{"No": "73521099", "Title": "I would like a possibility to record a new keyboard combination at runtime, that can then be bound to a function. PYTHON", "Content": "tell me how to read hotkeys in python? I would like a possibility to record a new combination at runtime, that can then be bound to a function.", "Vote": "0", "Answer": "0", "View": "17", "Author": "FDFD FDFD"},
{"No": "73521035", "Title": "What's the point of {} followed by format and how to use it in python? [duplicate]", "Content": "I'm having trouble understanding the point of {} since when I see it, it's used the same way as a print(\"\",variable,\"\"). I've only learned about it today and it's used like this: ...", "Vote": "-1", "Answer": "3", "View": "54", "Author": "2ndYear"},
{"No": "73520997", "Title": "Is there any python method that is able to extract value of key between [ ] sign in a long string?", "Content": "I am using geodjango ,and i would  extract the value of \"EPSG\" from the long string returned from a code as below: PROJCS[\"WGS_1984_UTM_Zone_42N\",GEOGCS[\"WGS 84\",DATUM[&...", "Vote": "0", "Answer": "1", "View": "20", "Author": "Alae Tube"},
{"No": "73520994", "Title": "python mechanize get element by id and data-row for auto-posting", "Content": "I'm trying to auto-post a form using mechanize library with python. Mechanize library uses \"name\" attribute. But for my project, I need to work with \"id\" and \"data-row\" ...", "Vote": "1", "Answer": "0", "View": "12", "Author": "piseynir"},
{"No": "73520971", "Title": "Combine Image Segmentation with Edge Detection [closed]", "Content": "I want to detect wall with image segmentation and change the color of the wall  so i searched and found this repository on github to detect wall  this is segmented Image (stackoverflow not allowing me ...", "Vote": "-3", "Answer": "0", "View": "18", "Author": "Amin Memar"},
{"No": "73520954", "Title": "Having some problem adding list values ​in loop", "Content": "My code: a = {} b = []  for i in range(1, 5):       a[\"Name\"] = i   print(a)   b.append(a)  print(b)  result is [{'Name': 4}, {'Name': 4}, {'Name': 4}, {'Name': 4}] how to make [{'Name': 1}, ...", "Vote": "-1", "Answer": "2", "View": "57", "Author": "Duy Nhut Bui"},
{"No": "73520907", "Title": "What is a free way to send text/sms messages with Python? [closed]", "Content": "I am building a program for a business that will notify clients by text when they have an upcoming appointment.  There will not be any media included, and the user will not need to respond to the text....", "Vote": "-1", "Answer": "2", "View": "19", "Author": "ACB_prgm"},
{"No": "73523831", "Title": "solve_ivp with differential equations that can't be expressed as their derivatives", "Content": "I wish to solve the system y' = y + u' u' = y' + u and it looks as if solve_ivp requires that I solve for the derivative and express it in terms of the original functions, but I'm not sure how to do ...", "Vote": "0", "Answer": "0", "View": "4", "Author": "Shishir Oneal"},
{"No": "73523817", "Title": "How to create a simple example APP w/Kivy using Python (without a separated module)?", "Content": "I'm not that experiencied with HMI apps. But ve been following a Youtube course (for college) and so far I could reproduce all examples. But It was only at the end of the subject that a doubt came, &...", "Vote": "-1", "Answer": "0", "View": "4", "Author": "caio_alBR"},
{"No": "73523815", "Title": "MoviePy RuntimeError: imageio.ffmpeg.download() has been deprecated", "Content": "I try to run a simple script in Google Colab to determine a length of a video: !pip install moviepy from moviepy.editor import * # Change directory: os.chdir(r'/content/my_data') clip = VideoFileClip(&...", "Vote": "0", "Answer": "0", "View": "7", "Author": "user136555"},
{"No": "73523785", "Title": "Pandas Conditional Columns", "Content": "I need to take specific text from Column A and based on it, I need to create a new column and add values to it.\r Device_users\r Old_Android_user\r New_Android_user\r Old_IOS_user\r Say I have the above ...", "Vote": "0", "Answer": "1", "View": "9", "Author": "SSRN"},
{"No": "73523759", "Title": "Convert column with number (string) into into float and integer", "Content": "I want to ask for solution to my problem. I have a dataframe column (string type data) and want to convert it into float and integer data type. In that column it has two type of number. The first type ...", "Vote": "0", "Answer": "0", "View": "25", "Author": "Jovian Aditya"},
{"No": "73523758", "Title": "How to select only the time from datetime column sqlalchemy", "Content": "I am new to sqlalchemy. How do I select and return only the time from a datetime column ? Is there a way to specifically cast a column as time ? Thanks in advance! Tablename = User_Log user_id = db....", "Vote": "0", "Answer": "0", "View": "13", "Author": "LiuBeiBei"},
{"No": "73520899", "Title": "How increment and decrement list index with button click in Flask", "Content": "I have a couple of rows with two columns. Something like this- {% for row in data %} <tr>  <td><li>{{ row.doc[0] }}</li></td>  <td><Button>PREV</Button>&...", "Vote": "-2", "Answer": "0", "View": "17", "Author": "Redwan Hossain Arnob"},
{"No": "73520893", "Title": "DFU_CLRSTATUS control transfer hangs and doesn't complete", "Content": "I am utilising the checkm8 exploit on my old iPad, trying to write my own implementation using the libusb-wrapper library python-libusb. When I send a control transfer with a request of 4 (...", "Vote": "0", "Answer": "0", "View": "11", "Author": "Alfie CG"},
{"No": "73520873", "Title": "Similarity matrix of dataframe with array columns values", "Content": "I have csv data. I want to compute the similarity matrix of rows. However, the values of the columns are an array. When the columns were a single value, I used: Dataset = pd.read_csv(\"MyData.csv&...", "Vote": "-1", "Answer": "0", "View": "25", "Author": "guelib bouchra"},
{"No": "73520856", "Title": "How to run a cython script through a python file?", "Content": "I have a compiled cython script which i normally run in powershell by typing py and then import main. But Is there a way to run the script in a python file so i can just run python run.py in ...", "Vote": "0", "Answer": "1", "View": "18", "Author": "Such Max"},
{"No": "73520830", "Title": "parallel execution of code in different tabs(same browser-chrome) with selenium", "Content": "I have the following code: driver_path = \"C:\\chrome_driver\\chromedriver\" class TwitterBot: def init(self, username, password): self.username = username self.password = password self.bot = ...", "Vote": "0", "Answer": "0", "View": "11", "Author": "alon"},
{"No": "73520828", "Title": "SQLAlchemy - How to rewrite a query as method of a SQLAlchemy class", "Content": "I have the following two tables defined in SQLAlchemy: class DataCollection(Base):     __tablename__ = \"datacollection\"     id = Column(Integer, primary_key=True, index=True)     owner = ...", "Vote": "0", "Answer": "0", "View": "17", "Author": "GKX"},
{"No": "73520826", "Title": "Problem handling next elements in for-loop Python", "Content": "I have my res_list of string that looks like this Sleep Morning_Meds 2 Morning_Meds Watch_TV 1 Watch_TV Sleep 3 Morning_Meds Sleep 1 Sleep Watch_TV 3  I know it's a simple task but I'm struggling ...", "Vote": "0", "Answer": "1", "View": "22", "Author": "Labarbona Dibaggio"},
{"No": "73520821", "Title": "PyQt6 Implementing copy-paste functionality across tabs in same window", "Content": "I am trying to create a tableWidget in PyQt that has copy-paste functionality and the ability to create new tabs. My table is loaded with a initialized sheet but gives the user the ability to create ...", "Vote": "1", "Answer": "0", "View": "24", "Author": "devman3211"},
{"No": "73520816", "Title": "Type annotating a function that returns a dynamic class", "Content": "I have a use-case where I have two classes: Foo and Bar. I want to write a function that, given one of these classes, dynamically creates a new class that is a subclass of the given class. This is ...", "Vote": "1", "Answer": "0", "View": "26", "Author": "Uri Yakir"},
{"No": "73523744", "Title": "I want sum of a column in some other column but based on condition of other column", "Content": "I have a data frame given below [![enter image description here][1]][1]  example for year 2016 'div' should only have sum of 'avg_coef' across only 2016  and same for 2017 'div' should only have sum ...", "Vote": "0", "Answer": "0", "View": "13", "Author": "Prabhat Singh"},
{"No": "73523737", "Title": "How can I request the user to use a value that is not negative?", "Content": "I was wanting to make a homework assignment that determines the highest user inputted value but I wanted the user to ONLY input positive intergers. Is there a way to make it so that if the user ...", "Vote": "-4", "Answer": "2", "View": "17", "Author": "Berryman"},
{"No": "73523735", "Title": "How can I formulate this Cplex objective function?", "Content": "with the next image:  and python Cplex, How can I establish a fixed cost price if factory open or not, for example: Warehouse 1 requires only 100 units of 'x' product from Factory 0 or Factory 1, ...", "Vote": "0", "Answer": "0", "View": "7", "Author": "Warpxz"},
{"No": "73523731", "Title": "How do I code the parameters, radio button to 0 or 1?", "Content": "My mind may be slipped. I am trying to do machine learning in pycharm. My file has converted to 0 or 1. However, when user type in their answers or select the radio button like Male or Female. How do ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "Isabelle Matthews"},
{"No": "73523724", "Title": "ValueError: could not convert string to float: '59:46.5' while reading timstamp", "Content": "I have timestamp in my data of this format 59:46.5 My data looks like this  I am applying clustering techniques to detect outliers but I got errors File \"pandas_libs\\lib.pyx\", line 615, in ...", "Vote": "0", "Answer": "0", "View": "18", "Author": "user12"},
{"No": "73523710", "Title": "complex update of json in python", "Content": "I have this sample json : { \"context\": \"syllabus\",    \"subjects\":{      \"english\":[       {\"english_chapter1.txt\":{ \"lines\":100,         &...", "Vote": "-1", "Answer": "2", "View": "31", "Author": "jbabu"},
{"No": "73523704", "Title": "How to receive entire data comming from server in python socket", "Content": "I am Using Python socket lib, i want to receive the entire data coming from server i have tried using loops but it stucking after reading the data.     def readReply(self):         recv_data = b''     ...", "Vote": "0", "Answer": "1", "View": "12", "Author": "Jocefyneroot"},
{"No": "73520801", "Title": "How to install numpy on Elastic Beanstalk?", "Content": "I am using Elastic Beanstalk to host my spring boot application (generating jar package based on maven), in my spring boot project I need to read python script, the python script contains numpy and ...", "Vote": "0", "Answer": "1", "View": "14", "Author": "KiteZeng"},
{"No": "73520795", "Title": "Python type() Function with integers in python", "Content": "<class 'int> represents the class in python that represents integers. For example:      a = 9          print(type(a)) # this will show you the type of the variable **a**     type_a = type(a) # ...", "Vote": "-2", "Answer": "0", "View": "43", "Author": "Dev Mallik"},
{"No": "73520783", "Title": "Loop skips elements of a list", "Content": "Problem: When iterating over a list of urls to scrape information, there are certain urls that are skipped. These same urls that it skips when I test them separately or in small groups, it gets the ...", "Vote": "0", "Answer": "0", "View": "47", "Author": "Carlos Lozano"},
{"No": "73523677", "Title": "ValueError: 'c' argument has 1000 elements, which is inconsistent with 'x' and 'y' with size 500", "Content": "I'm in my way of studing anomaly detection for speech data. My original code written with LSTM, but I'm in faced to imbalance dataset. So I'm trying to have some insights from Pyod. On trying from ...", "Vote": "0", "Answer": "1", "View": "24", "Author": "Hailey"},
{"No": "73523622", "Title": "How do i update a plot inside a loop python", "Content": "I'm measuring the time it takes to solve a linear system. Im comparing the time it takes between the solve and inv linalg functions. This is what i have so far. import numpy as np from datetime import ...", "Vote": "0", "Answer": "1", "View": "28", "Author": "walkingwhale"},
{"No": "73523614", "Title": "Heritage Trouble ¿? : TypeError: object.__init__() takes exactly one argument (the instance to initialize) [closed]", "Content": "I don't really know if there's a trouble with the heritage of Obstacle and super() call. I just don't get what is the instance to initialize. class Obstacle:     def __int__(self, image, ...", "Vote": "0", "Answer": "0", "View": "22", "Author": "Juan Felipe Quintero Molina"},
{"No": "73523580", "Title": "Pylance giving wrong errors regarding comparison operators and members of modules", "Content": "Pylance doesn't recognize the \"socket\" module. There's no Intellisense for it and when I write code, I only get squiggly lines on everything I call, even though it's a member of the core ...", "Vote": "0", "Answer": "0", "View": "14", "Author": "MySurmise"},
{"No": "73523574", "Title": "Why does this program only work when run without debugging in Visual Studio Code?", "Content": "When run without debugging, it works perfectly fine but when run with debugging, there is an error message: Exception has occurred: FileNotFoundError [Errno 2] No such file or directory: 'piratein.txt'...", "Vote": "0", "Answer": "2", "View": "28", "Author": "Aaron Baker"},
{"No": "73523549", "Title": "Github Dependabot Alert is telling me update internal dependency `pywin32`: Integer overflow in pywin32", "Content": "An integer overflow exists in pywin32 prior to version b301 when adding an access control entry (ACE) to an access control list (ACL) that would cause the size to be greater than 65535 bytes. An ...", "Vote": "0", "Answer": "0", "View": "16", "Author": "higgsBoson1"},
{"No": "73523534", "Title": "capture pattern_X repeatedly, then capture pattern_Y once, then repeat until EOS", "Content": "I'm reverse-engineering a massive ETL pipeline, I'd like to extract the full data lineage from stored procedures and views. I'm struggling with the following regexp. import re  select_clause = \"`...", "Vote": "1", "Answer": "2", "View": "24", "Author": "Lorinc Nyitrai"},
{"No": "73523533", "Title": "How to extract a list from a string in a list in python", "Content": "I read a list of lists from a txt file and I got a list like this: [\"[21049090, 'AARTIIND22AUGFUT', 'AARTIIND', 850, 1793]\", \"[21049346, 'ABB22AUGFUT', 'ABB', 250, 3329]\"]  Each ...", "Vote": "-2", "Answer": "3", "View": "47", "Author": "KawaiKx"},
{"No": "73523523", "Title": "Python - How can I pass variable in Flask when clicked on a button", "Content": "I am working on a Flask project that has two pages (firstpage, secondpage). The first page has two buttons. When a user clicks on one of them, it should send a variable (variable name is value) with ...", "Vote": "1", "Answer": "2", "View": "25", "Author": "rookie654"},
{"No": "73523512", "Title": "Extract More Than Two Dimensions via Python: sklearn.cross_decomposition import CCA & transform", "Content": "I am very interested in using Python to extract 3-4 Dimensions via Canonical Correlation Analyses. I am pasting my very basic code below, and it appears to always default to only extracting two ...", "Vote": "1", "Answer": "1", "View": "12", "Author": "Zach"},
{"No": "73523508", "Title": "Packaging my application for another computer", "Content": "I have developed an application with Python 3.10, the files structure is like - ROOT_FOLDER    * MyApp_FOLDER    * MyUtil_FOLDER  The application is MyApp , which is using my own functions in MyUtil. ...", "Vote": "0", "Answer": "0", "View": "17", "Author": "Roger Yang"},
{"No": "73523503", "Title": "How do I make a temprole command", "Content": "I would like to make a temprole command For discord.py! But I don't know how as I just started learning the language and I was referred to stack overflow to look it up but noone had it so I thought ...", "Vote": "-3", "Answer": "0", "View": "10", "Author": "PlotchyJet"},
{"No": "73523448", "Title": "How to access to attrbuite of another model or table using ManyToMany in django", "Content": "Please, I need your help. how can access to  attruite of another models using ManyToMany in django Thank you in advance :) ---this is the Models.py => class  User(AbstractUser):     est_association ...", "Vote": "0", "Answer": "0", "View": "24", "Author": "Othmane Boudali"},
{"No": "73522078", "Title": "Web Scraping LinkedIn with BeautifulSoup - can't scrape from specific job page, given in the href on job listings page", "Content": "I have only recently started coding and I am trying to build a LinkedIn web scraper. I am having trouble scraping the specific job pages on LinkedIn, after having scraped the job listings. ...", "Vote": "0", "Answer": "0", "View": "14", "Author": "Connor Joseph"},
{"No": "73523433", "Title": "Equivalent to matlab's imagesc in matplotlib? duplicate", "Content": "I am answering my own question because the system says I do not have enough reputation to comment on the original question. One way to solve this problem is by importing matplotlib.image. The ...", "Vote": "0", "Answer": "0", "View": "11", "Author": "AOK"},
{"No": "73523395", "Title": "dimension and shapes phyton", "Content": "I'm trying to plot the results but I'm getting an error of dimension and shapes import numpy as np import matplotlib.pyplot as plt  c = 4 k = 2 m = 20 F = 5   Ts = 0.1 # Sampling Time Tstart = 0 # End ...", "Vote": "-1", "Answer": "1", "View": "22", "Author": "Cesarengineer"},
{"No": "73523393", "Title": "Healpy mask map and angular power spectra from the mask map", "Content": "I have run a simulation using NSIDE=512 (but projected only 49152 light rays and that is equivalent to NSIDE=64) to compute the lensing shear. So, that means I have the data that covers only a small ...", "Vote": "0", "Answer": "0", "View": "15", "Author": "Photon"},
{"No": "73523385", "Title": "unsupported operand type(s) for *: 'QuerySet' and 'IntegerField'", "Content": "Im trying to multiply the result from subquery with 1000 but instead i got the error \"unsupported operand type(s) for *: 'QuerySet' and 'IntegerField'\" this is my code :  last_lrpa = ...", "Vote": "0", "Answer": "0", "View": "21", "Author": "Andi Fathul Mukminin"},
{"No": "73523382", "Title": "How to exclude word from matching that is optional using regex", "Content": "I want to be able to match the following: top of pole top of existing pole existing top of pole  but not proposed top of pole  I tried to use ((!=proposed)\\s)*top\\sof\\s(existing\\s)?pole with look back,...", "Vote": "0", "Answer": "1", "View": "28", "Author": "ddd"},
{"No": "73523372", "Title": "How to Insert a partition into BigQuery's fetch time partitioned table in Python by specifying a partition", "Content": "summary How can I use Python to specify partitions in the fetch time partitioning table to fetch? What we tried I have found that the following is possible when inserting in SQL. https://cloud.google....", "Vote": "0", "Answer": "0", "View": "10", "Author": "yamap_55"},
{"No": "73523356", "Title": "Merge 2 dataframes between start date and end date range pandas [duplicate]", "Content": "I am actually having 2 dataframes as below: DataFrame 1 colA   colB   startDate   EndDate 1      L1     1/8/2022    4/8/2022 2      L2     2/8/2022    10/8/2022  DataFrame 2 colA   colB   startDate 3  ...", "Vote": "1", "Answer": "2", "View": "33", "Author": "python_interest"},
{"No": "73523338", "Title": "Why won't Selenium (Python) click() or send_keys() to this textarea? (TimeoutException)", "Content": "I've been working with this online form and having no problems getting Selenium to click() or send_keys() on other elements. But one element (the \"Notes\" textarea toward the end of the form) ...", "Vote": "0", "Answer": "2", "View": "18", "Author": "nocryinginprogramming"},
{"No": "73523335", "Title": "No Credential Error AWS Wrangler, but file still uploads", "Content": "I try this code, and I get a NoCredentialsError: Unable to locate credentials error. But when I look on AWS the parquet file is in s3? I don't have AWS CLI installed. How? boto3.setup_default_session(...", "Vote": "0", "Answer": "0", "View": "9", "Author": "toaster"},
{"No": "73522057", "Title": "ERC20 transferFrom() test in showing an error in Brownie", "Content": "I created a simple ERC20 token, and wrote a brownie test for the token. Inside the brownie test I am trying to transfer token from one account to another using transferFrom. I have also given it the ...", "Vote": "0", "Answer": "0", "View": "12", "Author": "FaizanNehal"},
{"No": "73522056", "Title": "Why is github trying to download a file that doesn't exist? [duplicate]", "Content": "I can't upload my code to github. error: remote: error: File vendor/firefox/libxul.so is 143.71 MB; this exceeds GitHub's file size limit of 100.00 MB. But such a file has not been in the folder for a ...", "Vote": "0", "Answer": "0", "View": "14", "Author": "Alexander"},
{"No": "73522053", "Title": "error while uploading arduino code avrdude: stk500_cmd(): programmer is out of sync", "Content": "I am trying to upload the Arduino code in Arduino nano but I am getting the error avrdude: stk500_cmd(): programmer is out of sync avrdude: stk500_cmd(): programmer is out of sync I tried several ...", "Vote": "0", "Answer": "0", "View": "8", "Author": "Ashish"},
{"No": "73522033", "Title": "I can not get ssl sertifi", "Content": "I try to get ssl sertfi: pip install sertifi open /Applications/Python\\ 3.10/Install\\ Certificates.command  And i have the error: Error when getting information for file “/Applications/Python 3.10/...", "Vote": "0", "Answer": "0", "View": "8", "Author": "WZXV"},
{"No": "73522028", "Title": "Filters for CBV ListView using GET from Previous and Current Page", "Content": "I am trying to add search functionality to a ListView in two places in my Django application. From the homepage, I want users to be able to filter by zip code, and on the ListView template, I also ...", "Vote": "0", "Answer": "1", "View": "16", "Author": "Max Meade"},
{"No": "73522026", "Title": "Python. Merge multiple Excel files and add a column with the original file's name", "Content": "I am hoping somebody will be able to tell me why I am doing wrong, please? My code reads three Excel files: 0122.xls, 0222.xls and 0322.xls and merges them together in a data frame. My problem is that ...", "Vote": "0", "Answer": "1", "View": "17", "Author": "Adrian"},
{"No": "73522024", "Title": "I solve a code in Coursera using this method and it worked but they didn't accept it?", "Content": "Modify the student_grade function using the format method, so that it returns the phrase \"X received Y% on the exam\". For example, student_grade(\"Reed\", 80) should return \"...", "Vote": "0", "Answer": "1", "View": "20", "Author": "MalakTammam"},
{"No": "73523332", "Title": "Filtering by latest date based on another dataframe", "Content": "df_1 =  code   year   date       class   Cols…   00      1   2022-01-01    1A   01      1   2022-01-01    1B   02      2   2022-01-02    1C   03      3   2022-01-03    1C   04      3   2022-01-03    ...", "Vote": "0", "Answer": "0", "View": "19", "Author": "johnnydoe"},
{"No": "73523330", "Title": "Is there a way to make sure a sprite collides with 2 sprites in a group?", "Content": "So, i'm trying to make it so when my player collides with a tile in the group self.tiles, and if my player is running at the tile in the right direction, set the player back to the left of that tile. ...", "Vote": "0", "Answer": "0", "View": "13", "Author": "22S3-C alden limyuhong"},
{"No": "73523306", "Title": "Repeat rows in a Polars DataFrame based on column value", "Content": "I would like to expand the following Polars dataframe by repeating rows based on values in the quantity column. Original DataFrame:\r Fruit Quantity\r Apple 2\r Banana 3\r Expected Output:\r Fruit Quantity\r...", "Vote": "0", "Answer": "1", "View": "15", "Author": "NFern"},
{"No": "73523284", "Title": "What is a VS Code Command to run a python file?", "Content": "I have made an extension that opens a file dialog. What I would like to do is after the file is selected, I want a python file to run. What I need is the VS Code command to run a file (or perhaps a ...", "Vote": "0", "Answer": "0", "View": "27", "Author": "Vera-6"},
{"No": "73523269", "Title": "Can't install torchaudio in anaconda", "Content": "I am trying to install from the anaconda prompt with pip install torchaudio==0.6.0 ERROR : Could not find a version that satisfies the requirement torchaudio==0.6.0 (from versions : 0.11.0, 0.12.0, 0....", "Vote": "0", "Answer": "0", "View": "12", "Author": "양준우"},
{"No": "73523236", "Title": "Scrape more than one page using python", "Content": "I'm trying to scrape the different prices for an item and i would like to scrape all the available pages to get the average price ,i've tried the below code but it is not working properly:      ...", "Vote": "-2", "Answer": "2", "View": "34", "Author": "Dalia Tawfeek"},
{"No": "73523230", "Title": "Comparing two dataframes based on date", "Content": "First df_1 looks like this:  my_id     series         date  category      value           000         1    2022-08-10         A      alpha    100         2    2022-08-10         A      alpha    101    ...", "Vote": "0", "Answer": "0", "View": "23", "Author": "ScienceFreakGuy"},
{"No": "73522021", "Title": "factorizing on a slice of a df", "Content": "I'm trying to give numerical representations of strings, so I'm using Pandas' factorize For example Toyota = 1, Safeway = 2 , Starbucks =3 Currently it looks like (and this works): #Create easy unique ...", "Vote": "0", "Answer": "3", "View": "29", "Author": "mikelowry"},
{"No": "73522011", "Title": "Brew symbolic linking for Python is not working. What can I do?", "Content": "Today, I tried installing Python (3) with the brew package manager. I did it using the normal procedure: running the command brew install python. Installing seemed to go well; I don't get any errors. ...", "Vote": "0", "Answer": "1", "View": "11", "Author": "MaestroMaus"},
{"No": "73522001", "Title": "Persisting external classes in Django", "Content": "I am working on a Django application that uses the SimpleGmail package to fetch mails from a Gmail inbox and I need to persist them. Normally I'd have written a model for the class, but given it's an ...", "Vote": "0", "Answer": "0", "View": "9", "Author": "TomTom"},
{"No": "73521995", "Title": "I need to recursively get the half of even integers in a list in python", "Content": "I've gotten most of my code, but the only thing I'm struggling with is getting the odd numbers out of my created list. Here is my code: def halfEven(x):     if not x:         return []     else:       ...", "Vote": "0", "Answer": "2", "View": "31", "Author": "Sam Jones"},
{"No": "73521992", "Title": "Python-Making a training and testing set from a tensor", "Content": "I have two tensors one real_image_tensors  and one drawing_tensors they are both currently in order, where the first image in real_image_tensors is the reference picture for the drawing in ...", "Vote": "0", "Answer": "1", "View": "22", "Author": "Spencer"},
{"No": "73521981", "Title": "How do I parallelize for a for loop in Python like Matlab's parfor?", "Content": "I am new to Python and am coming from a Matlab-only coding background. I am trying to teach myself Python and am starting by rewriting one of my Matlab codes in Python. I have a bit of code where I am ...", "Vote": "0", "Answer": "0", "View": "17", "Author": "tmay"},
{"No": "73521976", "Title": "FAST Feature Detector Scores can not be obtained", "Content": "I am trying to find keypoint on an image. When I use opencv FAST feature detector kp variable is tuple with datatype of KeyPoint. When I try to obtain coordinates and scores of the point I could not ...", "Vote": "0", "Answer": "0", "View": "15", "Author": "ahmetarsss"},
{"No": "73521952", "Title": "How to unpack a dataframe column with tuples of different length?", "Content": "I have a Pandas dataframe that looks like this: df = pd.DataFrame({'c1': [10, 20, 30, 40, 50,60,70],                      'c2': [[(0.14507, 0.163054, 0.330704), (0.069578, 0.075506, 0.145531), (0....", "Vote": "1", "Answer": "1", "View": "24", "Author": "dsilva"},
{"No": "73521945", "Title": "What is the 'v' Exception in Python?", "Content": "I have this code: def main():   root = Tk()   root.geometry('500x500')   Label(root, text = \"Hello! Do you want to view stocks, view your money, or quit?\", font = ('arial bold', 14 ), ...", "Vote": "-2", "Answer": "0", "View": "34", "Author": "Dark Shadow"},
{"No": "73521938", "Title": "How to use timezone.now() in django with activate timezone?", "Content": "I am using Django 3.2 and changed my setting.py as TIME_ZONE = 'Asia/Calcutta'  USE_I18N = True  USE_L10N = True  USE_TZ = True  and try to use timezone.now() It gives me the UTC time when I print it ...", "Vote": "0", "Answer": "0", "View": "17", "Author": "shraysalvi"},
{"No": "73521930", "Title": "how to create a table by picking all the column values from a file using pyspark", "Content": "I have a text file which includes column names of the table for ex: My txt file has below mentioned column values table1=[a,b,c,d] table2=[e,f,g,h]  I want to create a table if it not exists by using ...", "Vote": "0", "Answer": "0", "View": "13", "Author": "Swati B"},
{"No": "73521901", "Title": "Printing a String on One Line With Delay [duplicate]", "Content": "I'm trying to make a cool python text game. I wanted to print out each character on the same line with some delay (like lots of text games and rpgs do), rather than just have a sentence appear. from ...", "Vote": "0", "Answer": "0", "View": "22", "Author": "C14179"},
{"No": "73521885", "Title": "Getting the image of a source from a website and adding it to embed image discord.py", "Content": "How can I get an image from a website when the image is random every time? For example the website I want to get the images from is https://nekos.life/ and each time you reload the site, The image is ...", "Vote": "-1", "Answer": "1", "View": "15", "Author": "Phoenix"},
{"No": "73521883", "Title": "Bayes Filter in Python [closed]", "Content": "Hello I am having issues with the step by step process on how to create a python program with the Bayes filter can anybody assist me with this issue? I am trying to do a simple 4 grid hallway ...", "Vote": "-3", "Answer": "0", "View": "15", "Author": "RNSTNT"},
{"No": "73521879", "Title": "model.predict ValueError: setting an array element with a sequence", "Content": "I am creating a small python program in which I am going to recommend an audiobook, based on the input values ​​given by the user. Obviously there is a dataset from which the data is taken, but it ...", "Vote": "0", "Answer": "0", "View": "19", "Author": "raffaele de france"},
{"No": "73521866", "Title": "How do i move my enemy with its animation in pygame?", "Content": "import pygame  win = pygame.display.set_mode((1000,750)) pygame.display.set_caption(\"TD GaME\") background_img = pygame.image.load('best_backgroundv2.png') background = pygame.transform.scale(...", "Vote": "-3", "Answer": "1", "View": "21", "Author": "pythone 1"},
{"No": "73521854", "Title": "How to properly import a socket into buildozer spec?", "Content": "I created a app that take port,ipv4 and connected to server. App created by kivy. Server and client created by socket - standart python module. I compilate code to apk (by google colab) and run. His ...", "Vote": "0", "Answer": "0", "View": "11", "Author": "Владислав Фесик"},
{"No": "73521837", "Title": "Running a simple Python script in ps1", "Content": "I'm trying to run a Python program from a ps1. I have RunCommand.cmd - powershell.exe -ExecutionPolicy Unrestricted -f %*  And install.ps1 - echo \"installing\"  > install.txt python ./...", "Vote": "0", "Answer": "0", "View": "17", "Author": "Dvir Naim"},
{"No": "73521832", "Title": "Regular expression that filters data", "Content": "I am thinking of making a filter with python that allows me to search the information of a file by giving me a regular expression, the search must be \"year-month\". I have a file with the ...", "Vote": "-2", "Answer": "2", "View": "33", "Author": "JGC"},
{"No": "73521815", "Title": "Imported file has a wrong encoding: 'charmap' codec can't decode byte 0x8d in position 4510: character maps to in django import-export", "Content": "I am trying to import data from a csv. Here is the csv's screenshot  as you can see I've imported another csv it was completely ok but. For this csv it's not working. I am getting the error all the ...", "Vote": "0", "Answer": "1", "View": "15", "Author": "Sukuna"},
{"No": "73521801", "Title": "Python: Scraping AWS Data Error - Max retries exceeded with url when using requests; [Errno 8] nodename nor servname provided, or not known'))", "Content": "I am trying to scrape AWS data and am getting region information from here. However, when I request the URL, I get an error. The code is below: url=\"https://aws.amazon.com/ec2/pricing/on-demand/&...", "Vote": "0", "Answer": "0", "View": "16", "Author": "atatam_anukah"},
{"No": "73521779", "Title": "Exception Value: Profile matching query does not exist", "Content": "I have automatically created a profile with signals when a user is created. In this profile you can add followers in the ManyToMany field called followers. But when I try to use the AddFollower or ...", "Vote": "0", "Answer": "0", "View": "10", "Author": "Rodolfo Schiavi"},
{"No": "73521773", "Title": "Extracting PubMed central article to Python Dataframe", "Content": "I'm working with PubMed central articles and need to create columns with 'pmc' id, 'title', 'abstract', 'full-text' and 'authors'. I have worked with other similar questions and unable to apply on my ...", "Vote": "1", "Answer": "1", "View": "25", "Author": "Learning"},
{"No": "73521749", "Title": "What is this code python error? \"3\" as Sample Output and \"Too chaotic\" those two should come [closed]", "Content": "#!/bin/python3  import math import os import random import re import sys\r def minimumBribes(q):  if __name__ == '__main__':    t = int(input().strip())     for t_itr in range(t):        n = int(input()...", "Vote": "-5", "Answer": "0", "View": "22", "Author": "Chamindu pushpika"},
{"No": "73521744", "Title": "Python digit sum function returns wrong digits on large numbers", "Content": "The function I wrote is fairly basic: It walks through every digit of num and prints it out. The remainder is then run again until the sample code is finished. num = 1000000000000000000000000000001 ...", "Vote": "0", "Answer": "1", "View": "36", "Author": "cubexy"},
{"No": "73521742", "Title": "Keeping the value of variable always as integer in python", "Content": "pay_rate is a class variable of class Item, I want to keep the value of this variable always as Integer.If I tries to change the value of this variable outside the class using the class name like Item....", "Vote": "0", "Answer": "0", "View": "19", "Author": "Ali Murtaza"},
{"No": "73521730", "Title": "Numpy 'logical and' producing different type list", "Content": "I am doing a logical operation on a data frame column data using NumPy. I am checking if a row value is less than two compared to the preceding and successful row. I am getting output but different ...", "Vote": "0", "Answer": "2", "View": "26", "Author": "Mainland"},
{"No": "73521715", "Title": "How to pass hyperparameter to a loop for?", "Content": "I'm trying to make a for loop of an isolation forest algorithm and I'm just wanting to pass the contamination parameter to it, how do I do that? thats the iForest line:     iforest_wines_teste = ...", "Vote": "0", "Answer": "0", "View": "16", "Author": "Gabriel Rodrigues"},
{"No": "73521705", "Title": "Why are threads overlapping eachother for the task? python", "Content": "I want to make it so that my individual threads don't preform the same list item(phone number) Here's what I have currently: from genericpath import exists import logging from operator import ...", "Vote": "-2", "Answer": "0", "View": "22", "Author": "frappic"},
{"No": "73521702", "Title": "Python trying to send email with smtplib not working", "Content": "I am trying to send emails with python and smtplib but whenever I try to it gives me an error my code: import smtplib import ssl from email.message import EmailMessage  subject = \"email from ...", "Vote": "1", "Answer": "0", "View": "15", "Author": "yavda"},
{"No": "73521693", "Title": "Pygame When touching the left or upper edge of your screen, the original cursor flickers/reappears [duplicate]", "Content": "I tried making a custom cursor by drawing an image of a cursor and update its position to the real cursor his position. Then I set the real cursor to invisible. This all works wonderful, but when you ...", "Vote": "0", "Answer": "0", "View": "11", "Author": "Benjamingert"},
{"No": "73521690", "Title": "Regex function for a specific location of a symbol", "Content": "Is there any way to replace the \"·\" symbol from a text except for the \"\\n·\\n\" case? Many thanks!", "Vote": "0", "Answer": "1", "View": "24", "Author": "SVP"},
{"No": "73521688", "Title": "Quotes issue in bash while executing python cmd line", "Content": "i am running a python command per below in bash env, it runs fine : python -c \"from ami_management import cleanup; cleanup.main(['10', 'ctm'])\"  But when i am passing variables : ...", "Vote": "0", "Answer": "1", "View": "16", "Author": "sharad jain"},
{"No": "73521680", "Title": "Copy text in python and paste by Ctrl + V in webdriver", "Content": "I have one site where I can't enter a password using send_keys , I have to use Ctrl+V there. But I don't know how this can be done, because I have Passwords, where all passwords are stored and I need ...", "Vote": "1", "Answer": "3", "View": "26", "Author": "Ambamamba"},
{"No": "73521658", "Title": "Forward filling missing dates into Python Panel Pandas Dataframe", "Content": "Suppose I have the following pandas dataframe: df = pd.DataFrame({'Date':['2015-01-31','2015-01-31', '2015-02-28', '2015-03-31', '2015-04-30', '2015-04-30'], 'ID':[1,2,2,2,1,2], 'value':[1,2,3,4,5,6]})...", "Vote": "1", "Answer": "2", "View": "22", "Author": "Rik"},
{"No": "73521607", "Title": "youtube downloader by pyscript", "Content": "I'm trying to make a youtube downloader by pyscript but I got this error <py-env>     - pytube </py-env>  <py-script >     from pytube import YouTube     url=\"https://www....", "Vote": "0", "Answer": "1", "View": "35", "Author": "Deuf Story"},
{"No": "73521602", "Title": "melt() function duplicating dataset", "Content": "I have a table like this:\r id name doggo floofer puppo pupper\r 1 rowa NaN NaN NaN NaN\r 2 ray NaN NaN NaN NaN\r 3 emma NaN NaN NaN pupper\r 4 sophy doggo NaN NaN NaN\r 5 jack NaN NaN NaN NaN\r 6 jimmy NaN ...", "Vote": "3", "Answer": "4", "View": "34", "Author": "Khola"},
{"No": "73521592", "Title": "Create multiple date columns from a date column, where row is not empty or null", "Content": "Im trying to use the method pivot_table() to convert test analysis from rows to columns, I got a test analysis, a test result and a test date, I need to convert the test date to column and drop this ...", "Vote": "0", "Answer": "1", "View": "31", "Author": "Javier Alejandro Rendon Carril"},
{"No": "73521580", "Title": "python script gets stuck on keylogger listner", "Content": "the keylogger is getting stuck on listening for keys i tried putting the listening part in another script but it wasnt practical, is it possible to utilise threading for this? log_dir = \"\"  ...", "Vote": "0", "Answer": "1", "View": "23", "Author": "Krocznik"},
{"No": "73521551", "Title": "Transform JSON to XLS file with Python", "Content": "I'm trying to transform a JSON file to a XLS file, but it returns me an error called: -> name = record['name'] TypeError: byte indices must be integers or slices, not str I've already tried do that ...", "Vote": "0", "Answer": "1", "View": "9", "Author": "KlaoBurn"},
{"No": "73521547", "Title": "How to make jupyter nbtextension hinterland autocomplete only for tab and not for enter", "Content": "Recently I have enabled hinterland extension on jupyter notebook. This gives very good suggestions but every time i enter the variable names and hit enter it gives me whatever it thinks is the best ...", "Vote": "0", "Answer": "0", "View": "7", "Author": "dallascow"},
{"No": "73521538", "Title": "Clone conda environment with Tensorflow and other packages", "Content": "I have created an environment using conda and set up tensorflow along with a few other packages. How do I clone this environment such that it is a direct replica of the environment itself? I plan to ...", "Vote": "0", "Answer": "0", "View": "6", "Author": "Jack Armstrong"}
]